[
    {
        "id": 0,
        "Section": "Project Mechanics",
        "slug": "sidetrackedbysizzle.html",
        "name": "Sidetracked by Sizzle",
        "content": "Explore the concept of getting Sidetracked By Sizzle with Mark Hazleton. Understand how to stay focused and avoid the allure of superficial attractions.",
        "description": "Explore the concept of getting Sidetracked By Sizzle with Mark Hazleton. Understand how to stay focused and avoid the allure of superficial attractions.",
        "keywords": "Sidetracked By Sizzle, Mark Hazleton, Focus, Superficial Attractions, Distractions",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-01-01",
        "changefreq": "monthly",
        "source": "/src/pug/sidetrackedbysizzle.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 1,
        "Section": "Project Mechanics",
        "slug": "lifelong-learning.html",
        "name": "Lifelong Learning",
        "content": null,
        "description": "Reinventing Yourself: The Transformative Power of Lifelong Learning",
        "keywords": "Lifelong Learning, Continuous Evolution, Professional Growth, Personal Development, Holistic Understanding, Learning Journey",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-01-10",
        "changefreq": "monthly",
        "source": "/src/pug/lifelong-learning.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 2,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/leadership/evolution-over-revolution.html",
        "name": "Evolution Over Revolution",
        "content": "Thoughts on Evolution Over Revolution",
        "description": "Description for Evolution Over Revolution",
        "keywords": "software development, evolutionary approach, revolutionary ideas, incremental improvements, pragmatic approach, Agile methodologies, sustainable innovation, gradual change, risk management, continuous improvement, market demands, adaptability, responsiveness, software architecture, evolutionary progress, disruptive innovation, Duke Nukem Forever, Betamax vs. VHS, Azure Front Door, Agile practices, iterative development, risk assessment, historical context, Waterfall to Agile transition, incremental changes, radical changes, sustainable innovation, technological advancements, hybrid approach, innovation labs, strategic implementation, technological excellence",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-01-19",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/leadership/evolution-over-revolution.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 3,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/leadership/from-features-to-outcomes.html",
        "name": "From Features to Outcomes",
        "content": "Thoughts on From Features to Outcomes",
        "description": "Focus on outcomes, not just features",
        "keywords": "outcomes, project management, business value, features, measurable outcomes, success factors, key performance indicators, stakeholder collaboration, user satisfaction, agile methodologies, strategic alignment, value creation, feature fatigue, software development, outcome-focused development, user experience, business objectives, competitive advantage, strategic metrics, iterative improvement, organizational goals, performance evaluation, meaningful impacts, transformation, competitive advantage, agile frameworks, user engagement, business growth, operational efficiency, feature outputs, business and user outcomes",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-01-28",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/leadership/from-features-to-outcomes.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 4,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/leadership/",
        "name": "Leadership",
        "content": "Project Mechanics Leadership Overview",
        "description": "Project Mechanics Leadership Overview",
        "keywords": "team environment, project management, leadership, empowerment, delegation, mentoring, trust, fairness, competence, respect, quality, responsibility, consensus, goals, freedom, growth, commitments, consultation, monitoring, mentoring, supervision, project atmosphere, physical environment, task ownership, knowledge sharing, informal training, quality work, communication, groupware, multi-access forum, notes environment, documentation, team bonding, project outings, team member departures, project completion, lessons learned, authority, decision making, meetings, flat organization, delegation responsibilities",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-02-06",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/leadership/index.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 5,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/leadership/accountability-and-authority.html",
        "name": "Accountability and Authority",
        "content": "Thoughts on Accountability and Authority",
        "description": "Finding Balance Between Accountability and Authority",
        "keywords": "authority, accountability, leadership, effective management, decision-making, responsibility, project leadership, noblesse oblige, power, privilege, ethical leadership, organizational goals, team success, responsibility for actions, interdependent concepts, corporate social responsibility, ethical practices, inclusivity, coaching, mentoring, trust, morale, performance, organizational impact, project teams, junior leaders, delegation, ownership, consequences, success",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-02-15",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/leadership/accountability-and-authority.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 6,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/program-management-office.html",
        "name": "Program Management Office",
        "content": null,
        "description": "The Program Management Office Role in Project Delivery",
        "keywords": "project management, PMO, project mechanics, program managment",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-02-24",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/program-management-office.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 7,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/",
        "name": "Project Mechanics",
        "content": "The Art and Science of Project Management",
        "description": "The Art and Science of Project Management",
        "keywords": "Project Mechanics, software development, client delivery, project management, structured techniques, flexible approach, problem-solving, communication, efficient planning, agile response, project scope, resource management, stakeholder communication, adaptable framework, project management endeavors, project success, effective communication, client, staff, management, planning, organizing, managing resources, project goals, project objectives, leadership, project life cycle, project scope techniques, work breakdown analysis, task estimating, scheduling, risk management, cost management, quality assurance, quality standards, Project Management Professional, PMP, project execution, Project Management Institute, PMI, PMBOK Guide, project processes, project integration, project time, project cost, project quality, project human resources, project communications, project risk management, project procurement.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-03-05",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/index.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 8,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/project-life-cycle.html",
        "name": "Project Life Cycle",
        "content": null,
        "description": "From Idea to Delivery the Project Life Cycle",
        "keywords": "project life cycle, project management, project portfolio management, PPM, strategic goals, structured framework, project execution, resource allocation, stakeholder communication, project states, project feasibility, strategic objectives, resource availability, project success, project alignment, project governance, risk management, stakeholder satisfaction, project initiation, project planning, project design, project execution, project testing, project tracking, project estimating, project analysis, project scope, project stakeholders, needs analysis, project schedule, project objectives, project goals, project timeline, task assignment, project dependencies, project resources, project milestones, project change management, project deliverables, project review, project report, project cancellation, project proposal, project approval, project sponsor, project kickoff, project team, project charter, project status reports, project change control, project milestones, project completion, project invoice, post-implementation review, project lessons learned, project management software, project tracking software, project visibility, project collaboration, project communication, project resource management, project reporting, project analytics, project estimating, project cost, project duration, project effort, work breakdown structure, project contingency, project management tasks, project supervision, project transition, project documentation, project assumptions.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-03-14",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/project-life-cycle.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 9,
        "Section": "Case Studies",
        "slug": "sample-mvc-crud.html",
        "name": "SampleMvcCRUD Project",
        "content": null,
        "description": "The SampleMvcCRUD Project",
        "keywords": "ASP.Net MVC, CRUD operations, SampleMvcCRUD, .Net Core, NuGet packages, Microsoft .Net, Employee model, Bogus library, in-memory SQLite, fake data generator, User Interface, Single JavaScript Page, MVC Form Pages, AJAX, Razor Pages, PivotTable.js, data analysis, cloud computing, Infrastructure as a Service (IaaS), Platform as a Service (PaaS), Microsoft Azure, DevOps, Continuous Integration, Continuous Deployment (CI/CD), GitHub Actions, Application Containerization, Docker, lifelong learner, development skills, containerization, deployment options.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-03-23",
        "changefreq": "monthly",
        "source": "/src/pug/sample-mvc-crud.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 10,
        "Section": "Development",
        "slug": "decorator-pattern-http-client.html",
        "name": "The Decorator Pattern with Http Client",
        "content": "Explore the Decorator Design Pattern applied to an HttpClient in ASP.NET, elucidated by Microsoft ASP.NET Solutions Architect, Mark Hazleton.",
        "description": "Explore the Decorator Design Pattern applied to an HttpClient in ASP.NET, elucidated by Microsoft ASP.NET Solutions Architect, Mark Hazleton.",
        "keywords": "Decorator Design Pattern, Telemetry, HttpClient, structural design pattern, behavior, object, dynamically, wrapping objects, decorator objects, functionality, alternative to sub-classing, base class/interface, concrete implementation, decorator implementation, IHttpGetCallService, IHttpGetCallResults, HttpGetCallResults, HTTP request, HTTP response, HTTP client, System.Net.Http, high-level API, HTTP requests, HTTP responses, Hypertext Transfer Protocol, HTTP protocol, client-server communication, data communication, World Wide Web, request-response protocol, headers, message body, JSON, web applications, HttpClient Class, platform-independent, telemetry collection, performance monitoring, application usage, troubleshooting, software design problems, reusable object-oriented software, Gang of Four, software engineering, maintainable code, scalable code, dependency injection, C# Razor Page, Joke API, logging, caching, retry calls, Polly library, flexible design, dynamic behavior, interfaces, concrete class, decorator class, Stopwatch, HttpRequestMessage, JsonSerializer, exception handling, ILogger, IHttpClientFactory, dependency injection, HttpClientFactory, program.cs configuration, additional use cases, logging decorator, caching decorator, retry decorator, powerful tool, efficient applications, user needs.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-04-01",
        "changefreq": "monthly",
        "source": "/src/pug/decorator-pattern-http-client.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 11,
        "Section": "Development",
        "slug": "articles/nuget-packages-pros-cons.html",
        "name": "NuGet Package Pros and Cons",
        "content": "A comprehensive analysis of the benefits and risks of using NuGet packages in .NET development projects.",
        "description": "Comprehensive analysis of the pros and cons of using NuGet packages in .NET projects. Learn about security considerations, dependency management, and best practices for package selection.",
        "keywords": "NuGet packages, .NET development, package manager, software dependencies, security vulnerabilities, development costs, productivity, licensing, risk assessment, third-party libraries, dependency management, software security, package evaluation",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-04-10",
        "changefreq": "monthly",
        "source": "/src/pug/articles/nuget-packages-pros-cons.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 12,
        "Section": "Development",
        "slug": "git-organized.html",
        "name": "Git Organized",
        "content": null,
        "description": "Git Organized: A Guide to Organized Version Control",
        "keywords": "Git, version control, software development, branching strategies, pull requests, Git Flow, distributed version control, collaboration, codebase, repositories, GitHub, Azure DevOps, feature branch, hotfix, code management, remote repository, code quality, DevOps, code review, open-source projects, workflow, productivity, branching model, Linus Torvalds, Vincent Driessen, GitKraken, SourceForge, AWS CodeCommit, Bitbucket, GitLab, code changes, merge conflicts, file management, repository organization, development process.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-04-19",
        "changefreq": "monthly",
        "source": "/src/pug/git-organized.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 13,
        "Section": "Case Studies",
        "slug": "web-project-mechanics.html",
        "name": "Web Project Mechanics",
        "content": null,
        "description": "Description for Web Project Mechanics",
        "keywords": "Web Project Mechanics, web content management system, Microsoft platform, .NET Framework 4.8, GitHub repository, website management, Java Server Pages, JSP, migration, Microsoft ecosystem, codebase, caching implementation, Frogsfolly.com, DallasInformationCenter.com, JMShawminerals.com, website development, technology, efficient, user-friendly, performance, scalability, milestones, features, self-motivation, skills, refinement, passion, tools, resources, collaboration, travel guide, directory, minerals and gems, online sales.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-04-28",
        "changefreq": "monthly",
        "source": "/src/pug/web-project-mechanics.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 14,
        "Section": "Data Science",
        "slug": "data-analysis-demonstration.html",
        "name": "Data Analysis Demonstration",
        "content": "Visualizing Data with the Data Analysis Demonstration",
        "description": "Visualizing Data with the Data Analysis Demonstration",
        "keywords": "data analysis, data visualization, .Net tools, CSV file format, web applications, charting functionality, pivoting functionality, PivotTable.js, JavaScript library, summary table, pivot table, pivot chart, System.Web.UI.DataVisualization.Charting, Microsoft, business analyst, researcher, developer, Asp.Net Framework 4.8, data sets, data exploration, insights, customizable charts, line charts, bar charts, pie charts, data analysis demo, Mark Hazleton",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-05-07",
        "changefreq": "monthly",
        "source": "/src/pug/data-analysis-demonstration.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 15,
        "Section": "Development",
        "slug": "redis-local-instance.html",
        "name": "Redis Local Instance",
        "content": null,
        "description": "Redis Local Instance",
        "keywords": "Redis, Docker, in-memory data store, caching, session management, local Redis environment, Docker installed, Redis image, Docker Hub repository, Redis container, configuration options, command-line arguments, configuration file, port binding, host machine, local access, persist data, container removal, volume, mount point, Redis CLI, in-memory data storage, development, testing.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-05-16",
        "changefreq": "monthly",
        "source": "/src/pug/redis-local-instance.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 16,
        "Section": "Development",
        "slug": "cancellation-token.html",
        "name": "CancellationToken",
        "content": null,
        "description": "Harnessing the Power of CancellationToken for Efficient and Safe Asynchronous Programming",
        "keywords": "CancellationToken, asynchronous programming, Task class, C#, cancellation status, HttpClient, DownloadFileAsync, ThrowIfCancellationRequested, OperationCanceledException, TaskCanceledException, IsCancellationRequested, cancellation exceptions, WebSpark repository, .NET, best practices, asynchronous techniques, efficient, safe, responsive, cancellation requests, CancellationToken class, long-running operations, user interactions, resource management, graceful cancellation, propagate cancellation tokens, handle exceptions, sample code, GitHub, Decorator Pattern, ASP.NET APIs, MVC Core Controllers, C# guide, Managed Threads.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-05-25",
        "changefreq": "monthly",
        "source": "/src/pug/cancellation-token.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 17,
        "Section": "Development",
        "slug": "concurrent-processing.html",
        "name": "Concurrent Processing",
        "content": null,
        "description": "Learning Concurrent Processing Through Code with ChatGPT",
        "keywords": "concurrent processing, C# console application, synchronization, race conditions, deadlocks, SemaphoreSlim, task autonomy, scalability, resource management, thread safety, load balancing, task granularity, error handling, communication, coordination, debugging, testing, semaphore, resource utilization, concurrency control, .NET, SemaphoreSlim class, inter-process synchronization, intra-process synchronization, Microsoft Documentation, concurrency, multithreading, programming, developer, learning, code management, performance, efficiency, resource contention, semaphore release, telemetry, task management, semaphore count, thread management, debugging concurrent code, semaphore vs SemaphoreSlim",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-06-03",
        "changefreq": "monthly",
        "source": "/src/pug/concurrent-processing.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 18,
        "Section": "Development",
        "slug": "git-flow-rethink.html",
        "name": "Git Flow Rethink",
        "content": null,
        "description": "Revaluating the meaning of Continuous in CI/CD with Git Flow",
        "keywords": "Git Flow, Continuous Integration, Continuous Deployment, DevOps tools, branching methodology, version control, software development, Git Flow recap, Vincent Driessen, Git branching model, CI/CD practices, branch policies, Azure DevOps, production environment, codebase management, single-branch strategy, automated branch policies, GitHub, GitLab, quality assurance, pipelines, automated builds, versioning, release management, software delivery, productivity, software development processes.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-06-12",
        "changefreq": "monthly",
        "source": "/src/pug/git-flow-rethink.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 19,
        "Section": "ChatGPT",
        "slug": "using-chatgpt-for-developers.html",
        "name": "Using ChatGPT for C# Development",
        "content": "Unlock the potential of ChatGPT for C# development with Mark Hazleton\u0027s insightful guide. Explore real-world examples, improve code quality, and enhance developer productivity with ChatGPT. Dive into this comprehensive resource now.",
        "description": "Unlock the potential of ChatGPT for C# development with Mark Hazleton\u0027s insightful guide. Explore real-world examples, improve code quality, and enhance developer productivity with ChatGPT. Dive into this comprehensive resource now.",
        "keywords": "ChatGPT, C# development, ASP.Net, web-based application, natural language processing, OpenAI, AI, developer productivity, technical questions, code improvement, refactor, code readability, naming conventions, idiomatic constructs, code simplification, test cases, documentation, scaffolding code, HTTP requests, REST API, concurrent requests, SemaphoreSlim, Task.WhenAll, code generation, code explanation, code refactoring, code style, code efficiency, test generation, XML documentation, API client.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-06-21",
        "changefreq": "monthly",
        "source": "/src/pug/using-chatgpt-for-developers.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 20,
        "Section": "ChatGPT",
        "slug": "trivia-spark-development.html",
        "name": "Trivia Spark With ChatGPT",
        "content": null,
        "description": "Trivia Spark: Igniting Creativity with ChatGPT",
        "keywords": "trivia application, ChatGPT collaboration, Open Trivia database API, code snippets, prototype ideas, software development, Match Mode, lazy loading, GitHub Copilot, AI-powered code completion, Intellisense, machine learning models, code editor, context-aware suggestions, rapid prototyping, ENUM Parse, software development industry, Visual Studio 2022, Coderush, reference tool, Stack Overflow, .NET Rocks",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-06-30",
        "changefreq": "monthly",
        "source": "/src/pug/trivia-spark-development.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 21,
        "Section": "ChatGPT",
        "slug": "crafting-chatgpt-prompt.html",
        "name": "Crafting ChatGPT Prompt",
        "content": "Explore the art of crafting effective ChatGPT prompts with Mark Hazleton. Discover the significance of context, learn prompt engineering techniques, and unlock the potential of ChatGPT for better AI-powered conversations and code generation.",
        "description": "Explore the art of crafting effective ChatGPT prompts with Mark Hazleton. Discover the significance of context, learn prompt engineering techniques, and unlock the potential of ChatGPT for better AI-powered conversations and code generation.",
        "keywords": "ChatGPT, prompt engineering, AI, language model, context, tokenization, statistical patterns, human conversation, code generation, C# development, debugging, design patterns, custom instructions, content creation, customer support, coding assistance, education, personalized learning, prompt design, parameter tuning, API, OpenAI, ChatGPT API, hyperparameters, markdown formatting, user experience, alternative solutions, eloquent language, storytelling, cognitive verifier, few-shot prompting, chain-of-thought prompting.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-07-09",
        "changefreq": "monthly",
        "source": "/src/pug/crafting-chatgpt-prompt.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 22,
        "Section": "Development",
        "slug": "system-cache.html",
        "name": "System Cache",
        "content": null,
        "description": "Enhancing Web API Performance with a System Cached List",
        "keywords": "performance optimization, caching, System Cached List, web development, user experience, response times, weather API, data retrieval, cache miss, background cache refresh, MemoryCache, CachedData class, WebApiCache, improved performance, reduced latency, efficient resource usage, customizability, concurrency handling, graceful update process, stale data risk, increased complexity, memory usage, cold start overhead, CachedData class, SystemValuesCache class, fetchDataFunction, cache expiration times",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-07-18",
        "changefreq": "monthly",
        "source": "/src/pug/system-cache.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 23,
        "Section": "Blog Management",
        "slug": "articles/building-a-web-application-to-manage-your-blog-articles.html",
        "name": "Tools to Manage My Blog",
        "content": "In today\u0027s digital age, creating and managing a blog has become an essential part of sharing insights, experiences, and expertise with the world. For those who have an unquenchable thirst for both writing and technology, building a Web Content Management System (CMS) to maintain their blog articles might just be second nature. This article explores the journey of developing a web application to manage blog articles, delving into the process and the parallels with the creation of the Web Project Mechanics (WPM) framework. The Quest for a Better Web Content Management System For many avid bloggers, the desire to manage their articles in a more efficient and customized manner often leads to a journey of building their own CMS. Just as a skilled mechanic creates tools to simplify complex tasks, a developer might create a bespoke CMS to suit their unique needs. As the author of this article embarks on yet another adventure in web development, the goal is to create a user-friendly, versatile, and feature-rich application that simplifies article management. From Vision to Reality: Building the Blog Management Application The journey begins by architecting the web application. Drawing from previous experiences in web development, the author designs a system that employs the Model-View-Controller (MVC) pattern for a structured and organized codebase. With the vision set, the next step is to define the data structure, selecting JSON as the format for storing article information. The heart of the application lies in the ArticleService, responsible for reading, updating, and adding articles. Leveraging the power of C# and ASP.NET Core, the service interacts with JSON files, handling article data with ease. The service is more than just a simple data handler; it becomes the orchestrator of article-related actions, from CRUD operations to generating sitemap XML and even dynamically creating article templates. The Parallels: Web Project Mechanics Revisited For those familiar with the Web Project Mechanics (WPM) framework, the journey to build a blog management application may seem reminiscent of previous endeavors. Just as the WPM framework emerged from the need to streamline project management, this CMS venture arises from a passion for efficient content management. Just as WPM offers tools to simplify complex web development tasks, the CMS provides tools to streamline article creation, organization, and publication. The similarities between these projects highlight the author\u0027s affinity for crafting solutions that improve workflows and provide tailored experiences. Just as the WPM framework brought order to the chaos of web project management, this CMS tackles the challenges of blog management, empowering the author to create and share content effortlessly. Embracing the Journey As the journey unfolds, the parallels between creating a web application for blog management and crafting frameworks like WPM become apparent. The allure of transforming ideas into functional tools, refining workflows, and delivering value through technology is a driving force that propels developers forward. Just as a master craftsman refines their skills over time, each project contributes to the developer\u0027s repertoire of expertise. The adventure of building a CMS to manage blog articles is not merely a technical feat; it\u0027s a testament to the fusion of passion for writing and the art of coding. With every line of code, the author is not just creating software but crafting a tool that mirrors their values and enhances their capabilities. ConclusionIn the world of web development, the allure of crafting bespoke solutions is undeniable. Whether it\u0027s building a framework to streamline project management or creating a CMS to manage blog articles, the journey is characterized by passion, creativity, and a commitment to improving workflows. The author\u0027s journey to create a CMS to manage blog articles is a testament to their unyielding desire to meld their love for technology with their love for writing, resulting in a unique tool that empowers them to share their thoughts and insights with the world.",
        "description": "Building a Web Application to Manage Your Blog Articles: A Journey into Web Content Management Systems",
        "keywords": "blog management, web content management system, CMS, web application, article management, MVC pattern, JSON file, ArticleService, C#, ASP.NET Core, CRUD operations, sitemap XML, article templates, WPM framework, content management, article creation, article organization, article publication, ChatGPT prompts, Article Model, Razor Page, dependency injection, project management, Project Model, Project Service, interface creation, ASP.NET Core, code snippets, JSON persistence, web development, structured codebase, article metadata, project showcase, project data management.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-07-27",
        "changefreq": "monthly",
        "source": "/src/pug/articles/building-a-web-application-to-manage-your-blog-articles.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 24,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/conflict-management/",
        "name": "Conflict Management for Project Managers",
        "content": "Conflict management is an indispensable skill for project managers as conflicts are inherent in any project and can significantly impact team dynamics and project outcomes. In today\u0027s diverse project teams, conflicts can arise from differences in personality, perception, and task execution styles. This diversity, while valuable, also brings inevitable conflicts, from minor disagreements to more severe clashes.",
        "description": "Learn effective conflict management strategies to enhance your project management skills. Discover how to navigate conflicts among team members, clients, and handle poor performance. Ensure project success with these expert tips.",
        "keywords": "conflict management, project managers, conflict resolution, project success, team conflicts, personality conflict, client relationships, poor performance, dating policy, conflict resolution techniques, avoidance approach, domination approach, accommodation approach, compromise approach, consensus approach, communication skills, facilitation, common ground, analyze positions, Mary Parker Follett, constructive conflict, project objectives, team dynamics, project outcomes, consensus building, conflict resolution styles, conflict resolution tools",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-08-05",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/conflict-management/index.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 25,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/change-management/",
        "name": "Change Management",
        "content": "Change management is an important aspect of project management, as it helps to ensure that changes to the project are properly planned and implemented. Here are some best practices for successful project managers in change management:Communicate clearly: It is important to clearly communicate the reason for the change and how it will impact the project. This should be done in a timely manner to ensure that all stakeholders are aware of the change.Involve all stakeholders: It is important to involve all stakeholders in the change management process, including team members, customers, and other parties who will be affected by the change. This can help to ensure that the change is well-received and that potential issues are identified and addressed.Develop a plan: A change management plan should be developed to outline the steps that will be taken to implement the change and any potential impacts or risks.Monitor progress: It is important to monitor the progress of the change and make any necessary adjustments to ensure that it is implemented successfully.Evaluate the change: Upon completion of the change, it is important to evaluate its impact and assess whether it has achieved the desired results. This can help to identify any areas for improvement and inform future change management efforts.By following these best practices, project managers can effectively manage changes to the project and ensure that they are implemented smoothly and successfully.The project management process is creative, and will naturally bring about some change and the need for change management. The project manager\u0027s job is to recognize the inherent discovery process in the project and manage the change - not stop it.",
        "description": "Change management is an important aspect of project management, as it helps to ensure that changes to the project are properly planned and implemented",
        "keywords": "change management, project management, project sponsor, change control process, budget, scope, schedule, stakeholders, change management plan, monitor progress, evaluate change, tolerance level, manage expectations, project charter, project baseline, change request, project steering committee, project status reports, project status report format, visual aids, key messages, transparency, action items, weekly status report, project issues, accomplishments, planned activities, budget state, project burn rate, project schedule",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-08-14",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/change-management/index.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 26,
        "Section": "ChatGPT",
        "slug": "creating-a-php-website-with-chat-gpt.html",
        "name": "Creating a PHP Website with ChatGPT",
        "content": "TBD",
        "description": "Overcoming the Challenge of Unfamiliar Territory",
        "keywords": "PHP, ChatGPT, programming language, learning journey, .NET ecosystem, Microsoft ASP.NET, coding experience, continuous learning, digital realm, mastering PHP, interactive exploration, fundamental concepts, syntax, best practices, variables, data types, operators, control structures, input/output operations, code snippets, debugging assistance, project ideas, resource recommendations, regular practice, programming proficiency, CMS, content management system, dynamic page creation, Markdown files, search functionality, CSV files, JSON, GitHub, Azure App Service, Azure DevOps.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-08-23",
        "changefreq": "monthly",
        "source": "/src/pug/creating-a-php-website-with-chat-gpt.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 27,
        "Section": "Development",
        "slug": "task-list-processor.html",
        "name": "Task List Processor",
        "content": "TBD",
        "description": "Discover how the TaskListProcessor class streamlines concurrent operations in .NET, enabling efficient asynchronous programming and performance monitoring.",
        "keywords": "TaskListProcessor, concurrent operations, .NET development, asynchronous operations, efficient task management, error handling, Task.WhenAll, Parallel methods, scalability, performance optimization, telemetry, ILogger, TaskResult, WeatherService, real-world testing, CityThingsToDo service, travel dashboard, .NET version 8, GitHub repository.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-09-01",
        "changefreq": "monthly",
        "source": "/src/pug/task-list-processor.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 28,
        "Section": "Development",
        "slug": "articles/harnessing-the-power-of-caching-in-aspnet-with-memorycachemanager.html",
        "name": "Harnessing the Power of Caching in ASP.NET with MemoryCacheManager",
        "content": "TBD",
        "description": "In the dynamic world of ASP.NET development, optimizing performance is a cornerstone for building successful applications. Caching is one of the most effective strategies for this, and the MemoryCacheManager class is a vital tool in this endeavor. This article dives into its functionalities and benefits, complemented by demonstration code available on GitHub https://github.com/markhazleton/webspark",
        "keywords": "Memory Cache Manager, Caching, ASP.NET, MemoryCacheManager, API request limits, WebSpark project, WeatherServiceCachingDecorator, weather service, caching capabilities, cache keys, current weather data, weather forecasts, reduced latency, improved reliability, Concurrent Dictionary, Cancellation Token, cache eviction, cache entry options, Clear and Dispose, scalability, multi-threaded environments, IMemoryCache, Set method, Get method, Remove method, eviction policy, PostEviction callback, cache clearing, PerformActionWithLock, CancellationTokenSource, cache lifespan, cache invalidation, memory management, performance enhancement.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-09-10",
        "changefreq": "monthly",
        "source": "/src/pug/articles/harnessing-the-power-of-caching-in-aspnet-with-memorycachemanager.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 29,
        "Section": "Case Studies",
        "slug": "articles/taking-microsoft-copilot-studio-for-a-test-drive.html",
        "name": "Taking Microsoft Copilot Studio for a Test Drive",
        "content": "Mark Hazleton explores Microsoft Copilot Studio, sharing insights on creating a personalized AI chatbot, Copilot Mark. Discover how AI is revolutionizing site interactions and team communication.",
        "description": "Mark Hazleton explores Microsoft Copilot Studio, sharing insights on creating a personalized AI chatbot, Copilot Mark. Discover how AI is revolutionizing site interactions and team communication.",
        "keywords": "Microsoft Copilot Studio, AI chatbot, personalized chatbot, Copilot Mark, digital interactions, Microsoft\u0027s ecosystem, Windows Copilot, GitHub Copilot, Bing Copilot, AI-powered conversational capabilities, search engine technology, generative AI, user productivity, AI assistant, Power Virtual Agents, natural language processing, machine learning, data analytics, customization, integration capabilities, Microsoft Teams, Office 365, sentiment analysis, data analytics, Conversation Booster, Generative Answers, website integration, content moderation, digital presence, AI-generated responses, bespoke AI chatbot, digital interactions, transformative technology.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-09-19",
        "changefreq": "monthly",
        "source": "/src/pug/articles/taking-microsoft-copilot-studio-for-a-test-drive.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 30,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/project-meetings.html",
        "name": "Project Meetings",
        "content": "tbd",
        "description": "Project meetings can be the black hole of project management. ",
        "keywords": "project meetings, meeting guidelines, FoMS, meeting schedule, meeting minutes, agenda, action items, issue management system, brainstorming, project management planning, creative thinking, diverse group, idea generation, lateral thinking, mind mapping, six hats method, evaluate ideas, prioritize ideas, decision-making framework, Six Sigma DMAIC, facilitated sessions, facilitator, meeting objectives, participation, consensus, ground rules, parking boards, issues list, decisions list, actions list, information gathering, listing, brainstorming, grouping, prioritize, direct probe, indirect probe, redirection, playback, leading question, prompt question, tag question, float an idea, closing session.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-09-28",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/project-meetings.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 31,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/change-management/issue-management.html",
        "name": "Issue Management",
        "content": "Issue Management",
        "description": "issue management. ",
        "keywords": "issue management, issue resolution, project management, issue tracking, project success, issue identification, issue prioritization, root cause analysis, issue monitoring, centralized clearinghouse, issue log database, issue lifecycle, issue capture, issue prioritization, issue review, issue categories, functional bugs, content changes, stability issues, site enhancements, research request, process change, issue assignment, issue resolution process, scope change, issue status codes, issue capture form, issue tracking system, issue datetime, issue status, project requirement, issue title, priority, issue type, assigned to, issue owner, issue description, estimated hours, resolution description",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-10-07",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/change-management/issue-management.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 32,
        "Section": "Project Mechanics",
        "slug": "articles/the-art-of-making-yourself-replaceable-a-developers-guide-to-career-growth.html",
        "name": "The Art of Making Yourself Replaceable: A Guide to Career Growth",
        "content": "Explore how developers can enhance their career growth by embracing the concept of making themselves replaceable, focusing on adapting to the evolving tech landscape.",
        "description": "Explore how developers can enhance their career growth by embracing the concept of making themselves replaceable, focusing on adapting to the evolving tech landscape.",
        "keywords": "Developer Obsolescence, Software Development, Sustainable Software, Independent Software, Tech Innovation, Scalable Solutions, Tech Leadership, Software Resilience, Growth Opportunities in Tech",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-10-16",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-art-of-making-yourself-replaceable-a-developers-guide-to-career-growth.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 33,
        "Section": "Development",
        "slug": "articles/fire-and-forget-for-enhanced-performance.html",
        "name": "Fire and Forget for Enhanced Performance",
        "content": "Explore the use of Fire and Forget technique for improving API performance in tasks like Service Bus updates on user login.",
        "description": "Explore the use of Fire and Forget technique for improving API performance in tasks like Service Bus updates on user login.",
        "keywords": "async method, Fire and Forget, programming approach, tasks, unhandled exceptions, resource management issues, inconsistent application state, I/O operations, external systems, API performance, Service Bus updates, user login, non-critical tasks, main execution thread, user experience, online order processing, inventory check, fraud analysis, picking and packing, shipping label creation, automatic reorder of stock, order routing, supplier notification, warehouse management, logistics coordination, data analysis and reporting, CRM update, FireAndForgetUtility class, asynchronous operations, exception handling, logging, C#, .NET, sealed class, ILogger, SafeFireAndForget method, Task Continuation, Exception Handling, Cancellation Handling, application performance, responsiveness",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-10-25",
        "changefreq": "monthly",
        "source": "/src/pug/articles/fire-and-forget-for-enhanced-performance.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 34,
        "Section": "Project Mechanics",
        "slug": "articles/the-balanced-equation-crafting-the-perfect-project-team-mix.html",
        "name": "The Balanced Equation: Crafting the Perfect Project Team Mix",
        "content": "Discover the art of constructing the perfect project team mix, leveraging the unique strengths of both internal employees and external consultants for project success.",
        "description": "Discover the art of constructing the perfect project team mix, leveraging the unique strengths of both internal employees and external consultants for project success.",
        "keywords": "team building, project management, change makers, stability keepers, consultants, innovation, collaboration, company culture, team dynamics, organizational success, employee engagement, professional growth, knowledge transfer, specialized expertise, long-term goals, adaptability, resilience, inclusive work environment, project goals, skill gaps, teamwork, institutional knowledge, fresh perspectives, external viewpoint, sustainable solutions, creative solutions",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-11-03",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-balanced-equation-crafting-the-perfect-project-team-mix.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 35,
        "Section": "Case Studies",
        "slug": "articles/wichita-sewer-site-creation.html",
        "name": "From Concept To Live: The Unveiling Of The WichitaSewer.com Website",
        "content": "Discover the journey behind the creation of the Wichita Sewer and Drain website, from initial planning to final launch, and the lessons learned along the way.",
        "description": "Discover the journey behind the creation of the Wichita Sewer and Drain website, from initial planning to final launch, and the lessons learned along the way.",
        "keywords": "Wichita Sewer and Drain, website development, digital presence, Jonathan Roper, entrepreneurship, Node.js, npm, Pug Template Engine, Visual Studio Code, SB UI Kit Pro, GitHub, Azure Static Web Apps, Cloudflare, Screaming Frog SEO Spider, SEO, performance optimization, user-centered design, collaboration, iterative development, web technologies, project management, branding, logo design, web hosting, continuous integration, deployment, user experience, scalability, security, DNS management, cloud services, web performance, web security, SSL certificates, DDoS protection, traffic management, analytics integration.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-11-12",
        "changefreq": "monthly",
        "source": "/src/pug/articles/wichita-sewer-site-creation.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 36,
        "Section": "ChatGPT",
        "slug": "articles/generating-a-key-press-counter-with-chatgpt.html",
        "name": "Generating A Key Press Counter with Chat GPT",
        "content": "Explore the development of a key/mouse press counter by Mark Hazleton, focusing on user interaction, ethical considerations, and technical insights.",
        "description": "Explore the development of a key/mouse press counter by Mark Hazleton, focusing on user interaction, ethical considerations, and technical insights.",
        "keywords": "key press counter, ChatGPT, user interaction, ethical considerations, technical setup, user consent, privacy, Visual Studio, .NET Framework, .NET Core, Windows Forms Application, globalmousekeyhook, event handlers, logging, GitHub, innovation, software development, AI-assisted development, tray icon, balloon notifications, NotifyIcon class, System.Windows.Forms, user experience, key press activity, responsible AI use",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-11-21",
        "changefreq": "monthly",
        "source": "/src/pug/articles/generating-a-key-press-counter-with-chatgpt.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 37,
        "Section": "Blog Management",
        "slug": "articles/embracing-azure-static-web-apps-for-static-site-hosting.html",
        "name": "Embracing Azure Static Web Apps for Static Site Hosting",
        "content": "In the ever-evolving landscape of web development, the surge in popularity of static websites has been nothing short of remarkable. These sites, known for their speed, security, and simplicity, are increasingly becoming the go-to for developers and businesses alike. My journey with static websites has been transformative, leading me to embrace cloud-based solutions for hosting. Among these, Azure Static Web Apps stands out as a beacon of efficiency and innovation.",
        "description": "In the ever-evolving landscape of web development, the surge in popularity of static websites has been nothing short of remarkable. These sites, known for their speed, security, and simplicity, are increasingly becoming the go-to for developers and businesses alike. My journey with static websites has been transformative, leading me to embrace cloud-based solutions for hosting. Among these, Azure Static Web Apps stands out as a beacon of efficiency and innovation.",
        "keywords": "Azure Static Web Apps, static websites, web development, cloud-based solutions, hosting, global distribution, CI/CD, GitHub repository, GitHub Actions, serverless functions, Azure Functions, dynamic operations, deployment workflow, security features, authentication, authorization, real-time data, customization, cost management, billing, pricing model, scalability, performance, Netlify, Vercel, Azure ecosystem, GitHub Pages, customization options, serverless APIs, global network, content delivery network, CDN, integration, Azure Blob Storage, Azure Cosmos DB, community support, future developments, Microsoft, web applications.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-11-30",
        "changefreq": "monthly",
        "source": "/src/pug/articles/embracing-azure-static-web-apps-for-static-site-hosting.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 38,
        "Section": "Development",
        "slug": "articles/transforming-samplemvccrud-with-net-aspire-a-cloud-native-evolution.html",
        "name": "Transforming SampleMvcCRUD with .NET Aspire: A Cloud-Native Evolution",
        "content": "Discover how integrating .NET Aspire into the SampleMvcCRUD project revolutionizes it with cloud-native capabilities, enhanced observability, and seamless service orchestration. Dive into the journey of adopting microservices architecture and leveraging advanced telemetry for insightful application monitoring.",
        "description": "Discover how integrating .NET Aspire into the SampleMvcCRUD project revolutionizes it with cloud-native capabilities, enhanced observability, and seamless service orchestration. Dive into the journey of adopting microservices architecture and leveraging advanced telemetry for insightful application monitoring.",
        "keywords": ".NET Aspire, cloud-native, microservices architecture, SampleMvcCRUD, ASP.NET MVC, observability, OpenTelemetry, service orchestration, distributed applications, containerization, DevOps, scalability, maintainability, resilience, telemetry data, Azure Application Insights, orchestration features, logging, metrics, tracing, NuGet packages, cloud-native development, data access, caching mechanisms, messaging systems, health checks, testing and validation, documentation, knowledge sharing, Microsoft documentation, cloud-native environments, production-ready.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-12-09",
        "changefreq": "monthly",
        "source": "/src/pug/articles/transforming-samplemvccrud-with-net-aspire-a-cloud-native-evolution.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 39,
        "Section": "ChatGPT",
        "slug": "articles/chatgpt-meets-jeopardy-c-solution-for-trivia-aficionados.html",
        "name": "ChatGPT Meets Jeopardy: C# Solution for Trivia Aficionados",
        "content": "     p.lead As a developer passionate about trivia and data analysis, I\u0027ve been exploring ways to blend my interests in a single, engaging project. My journey led me to a unique intersection: incorporating a vast dataset of Jeopardy questions into my existing applications, TriviaSpark and the Data Analysis Demo, using C# and .NET.\r\n      h2 TriviaSpark: A Realm of Quizzes\r\n      p TriviaSpark, my trivia application, has been a playground for trivia enthusiasts, offering a wide range of quizzes across various domains. Designed with C#, it\u0027s been a testament to the versatility and power of .NET in creating interactive, user-friendly applications.\r\n      h2 Data Analysis Unleashed\r\n      p In my Data Analysis Demo, I delve into CSV files to unearth patterns, insights, and stories hidden within the data. This C#-powered project showcases the potential of .NET in processing and visualizing complex datasets, making data analysis accessible and insightful.\r\n      h2 The Jeopardy Discovery\r\n      p On a quest for intriguing CSV datasets, I stumbled upon a goldmine: a comprehensive CSV file of Jeopardy questions. This serendipitous find seemed like the perfect bridge between TriviaSpark and the analytical depth of the Data Analysis Demo, promising a fusion of trivia and data analytics.\r\n      h2 Crafting the Solution\r\n      p.code-block.bg-light.p-3 With the Jeopardy dataset in hand, I embarked on integrating it into a C# application. This endeavor was not just about importing data; it was about breathing life into the numbers and texts, turning them into an interactive trivia experience enriched with the analytical prowess of C# and .NET.\r\n      h2 Conclusion\r\n      p This integration marks a milestone in my journey as a developer. It symbolizes the confluence of trivia, data analysis, and software development, illustrating how diverse interests can converge into a single, cohesive project. With ChatGPT\u0027s insights and C#\u0027s flexibility, the Jeopardy project stands as a testament to the endless possibilities in the realm of software development.\r\n",
        "description": "Discover how ChatGPT integrates Jeopardy questions into a C# application, combining trivia enthusiasm with advanced data analysis in .NET.",
        "keywords": "Jeopardy Console Application, ChatGPT, Trivia Aficionados, C# application, data analysis, .NET, TriviaSpark, trivia enthusiasts, quizzes, interactive applications, AI, user interaction, data science, CSV datasets, JSON structure, LINQ, Jeopardy questions, software development, trivia integration, data visualization, dynamic content, data analysis libraries, C# flexibility, software development possibilities",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2023-12-18",
        "changefreq": "monthly",
        "source": "/src/pug/articles/chatgpt-meets-jeopardy-c-solution-for-trivia-aficionados.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 40,
        "Section": "Case Studies",
        "slug": "articles/taking-fastendpoints-for-a-test-drive.html",
        "name": "Taking FastEndpoints for a Test Drive",
        "content": "Exploring the streamlined approach to building ASP.NET APIs",
        "description": "Exploring the streamlined approach to building ASP.NET APIs",
        "keywords": "FastEndpoints, ASP.NET, REPR pattern, Minimal APIs, .NET 6, API development, CRUD API, Person entity, model binding, dependency injection, REST endpoints, business logic, PersonService, Fast Endpoint, CreatePersonEndpoint, domain mapper, CreatePersonMapper, Swagger, GitHub, Azure Web App, GUIDs, auto-incrementing integers, database design, distributed systems, MVC, API endpoints, .NET Core, performance, scalability, modular web frameworks, HTTP methods, status codes, JSON deserialization, POCO types, middleware integration, custom response types, Person class, data model, CRUD operations, RESTful design, FastEndpointApi, web API development, mapping logic, DTOs, data transfer objects, PersonResponse, PersonEntity, CreatePersonRequest, PersonService class, code reusability, maintainability, separation of concerns, interactive documentation, microservice, high-performing APIs.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2023-12-27",
        "changefreq": "monthly",
        "source": "/src/pug/articles/taking-fastendpoints-for-a-test-drive.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 41,
        "Section": "PromptSpark",
        "slug": "articles/english-is-the-new-programming-language-of-choice.html",
        "name": "English is the New Programming Language of Choice",
        "content": "Explore the pivotal role of English in the evolution of the Microsoft Stack, specifically within .NET technologies such as C#, F#, VB.NET, and SQL. Understand why English is becoming as crucial as traditional programming languages in software development.",
        "description": "Explore the pivotal role of English in the evolution of the Microsoft Stack, specifically within .NET technologies such as C#, F#, VB.NET, and SQL. Understand why English is becoming as crucial as traditional programming languages in software development.",
        "keywords": "English, programming language, Microsoft Stack, .NET technologies, C#, F#, VB.NET, SQL, software development, AI, artificial intelligence, machine learning, linguistic shift, global reach, prompt engineering, AI Assistants, Open AI Chat GPT, Microsoft Co-Pilot, Bard, large language models, LLM, Azure AI services, conversational AI, data analytics, customer service bots, linguistic bias, linguistic diversity, accessibility, innovation, tech community, software development realm, collaboration, technology landscape.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-01-05",
        "changefreq": "monthly",
        "source": "/src/pug/articles/english-is-the-new-programming-language-of-choice.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 42,
        "Section": "PromptSpark",
        "slug": "articles/using-large-language-models-to-generate-structured-data.html",
        "name": "Using Large Language Models to Generate Structured Data",
        "content": "Explore how large language models like GPT-4 are revolutionizing data structuring, focusing on Mechanics of Motherhood\u0027s use of AI to structure JSON recipes.",
        "description": "Explore how large language models like GPT-4 are revolutionizing data structuring, focusing on Mechanics of Motherhood\u0027s use of AI to structure JSON recipes.",
        "keywords": "AI, structured data, JSON, OpenAI, LLM, recipe management, Mechanics of Motherhood, GPT-4, artificial intelligence, data structuring, JSON mode, recipe database, SEO, data integrity, large language models, quick weeknight dinners, family meal ideas, comfort food recipes, data entry, SEO optimization, web applications, JSON string, data formatting, recipe import, data management.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-01-14",
        "changefreq": "monthly",
        "source": "/src/pug/articles/using-large-language-models-to-generate-structured-data.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 43,
        "Section": "PromptSpark",
        "slug": "articles/prompt-spark-revolutionizing-llm-system-prompt-management.html",
        "name": "Prompt Spark: Revolutionizing LLM System Prompt Management",
        "content": "Discover how Prompt Spark offers comprehensive tools and resources for managing and optimizing LLM system prompts. Learn about features like the variants library, performance tracking, and prompt engineering strategies.",
        "description": "Discover how Prompt Spark offers comprehensive tools and resources for managing and optimizing LLM system prompts. Learn about features like the variants library, performance tracking, and prompt engineering strategies.",
        "keywords": "Prompt Spark, LLM system prompts, prompt management, prompt optimization, Microsoft ASP.NET, developers, LLM enthusiasts, variants library, performance tracking, A/B testing, persona interactions, transparency dashboard, educational content, interactive tutorials, model comparison, OpenAI API, token counts, Entity Framework, SQLite database, GitHub Copilot, ChatGPT, DevExpress CodeRush, Core Spark, Spark Variant, User Prompts, performance tracking, A/B Testing, educational resources, prompt engineering, AI technologies.",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-01-23",
        "changefreq": "monthly",
        "source": "/src/pug/articles/prompt-spark-revolutionizing-llm-system-prompt-management.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 44,
        "Section": "PromptSpark",
        "slug": "articles/integrating-chat-completions-into-prompt-spark.html",
        "name": "Integrating Chat Completion into Prompt Spark",
        "content": "Learn how chat completions enhances LLM interactions in the Prompt Spark project by enabling seamless chat functionalities for Core Spark Variants.",
        "description": "Learn how chat completions enhances LLM interactions in the Prompt Spark project by enabling seamless chat functionalities for Core Spark Variants.",
        "keywords": "Chat Completion, Prompt Spark, Large Language Models, Microsoft.SemanticKernel, AI-powered chat, conversational interfaces, system design, user interaction, accessibility, AI orchestration, plugins, multilingual support, Semantic Kernel, Core Sparks, Spark Variants, User Prompts, ChatCompletionController, real-time communication, SignalR, chat functionalities, LLM interactions, prompt engineering, Microsoft, OpenAI, Azure, Hugging Face, SDK, NuGet package, AI models, automation, extensibility, business processes, interactive learning, Jupyter notebooks, chat interface, chat history, conversation flow, context-aware, user-centric interactions, ethical use, inclusivity, engagement, technology democratization.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-02-01",
        "changefreq": "monthly",
        "source": "/src/pug/articles/integrating-chat-completions-into-prompt-spark.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 45,
        "Section": "PromptSpark",
        "slug": "articles/webspark-the-next-evolution-of-web-project-mechanics.html",
        "name": "WebSpark: The Next Evolution of Web Project Mechanics",
        "content": "xplore the journey from Web Project Mechanics to WebSpark, a suite of web applications designed by Mark Hazleton to enhance digital experiences.",
        "description": "Explore the journey from Web Project Mechanics to WebSpark, a suite of web applications designed by Mark Hazleton to enhance digital experiences.",
        "keywords": "web development, WebSpark, Web Project Mechanics, content management system, .NET Framework, Java Server Pages, Bootstrap 5, PromptSpark, AI technology, Large Language Models, RecipeSpark, TriviaSpark, digital experiences, Microsoft platform, scalability, integration capabilities, ASP.NET, MVC design pattern, .NET Core, cloud-native applications, performance improvements, streamlined development, modern digital needs, web applications, user-friendly interface, technological advancements, continuous innovation, practical solutions, business-to-consumer, enterprise project, Frogsfolly.com, FrontPage, Access database, multi-tenant solution, web CMS, high-performance framework, Long-Term Support, productivity enhancements.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2024-02-10",
        "changefreq": "monthly",
        "source": "/src/pug/articles/webspark-the-next-evolution-of-web-project-mechanics.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 46,
        "Section": "ChatGPT",
        "slug": "articles/azure-wiki-expert-gpt-a-game-changer-for-azure-devops-documentation.html",
        "name": "Accelerate Azure DevOps Wiki Writing with Azure Wiki Expert GPT",
        "content": "Learn how Azure Wiki Expert GPT speeds up Azure DevOps wiki writing by automating content generation in Markdown format. Boost productivity and ensure high-quality, consistent documentation with this powerful tool.",
        "description": "Learn how Azure Wiki Expert GPT speeds up Azure DevOps wiki writing by automating content generation in Markdown format. Boost productivity and ensure high-quality, consistent documentation with this powerful tool.",
        "keywords": "Azure DevOps, Wiki, documentation, Azure Wiki Expert GPT, content generation, Markdown, productivity, AI capabilities, DevOps documentation, project documentation, process documentation, knowledge sharing, collaboration, tracking, reporting, hierarchical organization, version control, formatting, permissions, searchability, navigation, integration, automation, Agile project management, CI/CD pipelines, infrastructure as code, code snippets, design patterns, architecture diagrams, Mermaid diagrams, table of contents, customizability, flexibility, improved productivity, business benefits.",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-02-19",
        "changefreq": "monthly",
        "source": "/src/pug/articles/azure-wiki-expert-gpt-a-game-changer-for-azure-devops-documentation.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 47,
        "Section": "Development",
        "slug": "articles/building-resilient-net-applications-with-polly.html",
        "name": "Building Resilient .NET Applications with Polly",
        "content": "Explore how Polly and HttpClient in .NET can be used together to create resilient applications. Learn to handle retries, timeouts, and transient faults effectively.",
        "description": "Explore how Polly and HttpClient in .NET can be used together to create resilient applications. Learn to handle retries, timeouts, and transient faults effectively.",
        "keywords": "resilient applications, Polly, HttpClient, .NET, retries, timeouts, transient faults, network instability, transient errors, service timeouts, resilience, transient-fault-handling, CancellationToken, retry policy, circuit breaker pattern, graceful degradation, rate limiting, throttling, timeout management, health monitoring, self-healing, HttpClient class, RESTful services, socket exhaustion, Polly library, exponential backoff, jitter, CancellationTokenSource, MockResults class, RemoteController class, long-running task, PollyController class, retry logic, exponential backoff, HttpResponseMessage, IHttpClientFactory, retry policy, transient errors, robust communication",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-02-28",
        "changefreq": "monthly",
        "source": "/src/pug/articles/building-resilient-net-applications-with-polly.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 48,
        "Section": "Development",
        "slug": "articles/the-singleton-advantage-managing-configurations-in-net.html",
        "name": "The Singleton Advantage: Managing Configurations in .NET",
        "content": "Unlock the power of the singleton pattern for managing configurations in .NET Core. Learn how to implement lazy loading, thread safety, and secure Azure Key Vault access.",
        "description": "Unlock the power of the singleton pattern for managing configurations in .NET Core. Learn how to implement lazy loading, thread safety, and secure Azure Key Vault access.",
        "keywords": "Singleton, ASP.NET Core, static class, singleton pattern, configuration management, dependency injection, DI, thread safety, scalability, maintainability, lifecycle management, testing challenges, global state, resource management, configuration values, .NET Core, .NET 8, factory pattern, observer pattern, configuration provider pattern, adapter pattern, decorator pattern, proxy pattern, Azure Key Vault, performance optimization, design patterns, shared resources, service management, modular design, testable code.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-03-08",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-singleton-advantage-managing-configurations-in-net.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 49,
        "Section": "Blog Management",
        "slug": "articles/moving-to-markhazletoncom.html",
        "name": "Moving to MarkHazleton.com",
        "content": "My experience migrating my blog from markhazleton.controlorigins.com to markhazleton.com, hosted on Azure Static Web Apps and using Cloudflare for DNS, with detailed steps and best practices",
        "description": "My experience migrating my blog from markhazleton.controlorigins.com to markhazleton.com, hosted on Azure Static Web Apps and using Cloudflare for DNS, with detailed steps and best practices",
        "keywords": "domain migration, SEO case study, MarkHazleton.com, sub-domain, top-level domain, brand authority, search engines, SEO efforts, domain authority, search engine results pages, user experience, SEO rankings, traffic patterns, migration checklist, site audit, Google Analytics, Google Search Console, Screaming Frog SEO Spider, 301 redirects, Cloudflare, internal links, external links, backlinks, Bing Webmaster Tools, crawl errors, sitemap, robots.txt, content structure, duplicate content, canonical tags, backlinks, social media profiles, Azure Static Web Apps, DNS rules, Cloudflare DNS, page rules, Google Search Console, sitemap submission, search rankings, site performance, domain management, branding, user experience, proactive monitoring, search rankings fluctuations, SEO performance.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-03-17",
        "changefreq": "monthly",
        "source": "/src/pug/articles/moving-to-markhazletoncom.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 50,
        "Section": "Development",
        "slug": "articles/migrating-samplemvccrud-application-from-net-8-to-net-9.html",
        "name": "Migrating SampleMvcCRUD Application from .NET 8 to .NET 9",
        "content": " Migrating a .NET MVC CRUD application from .NET 8 to .NET 9 involves several key steps to ensure compatibility, performance improvement, and better visibility through SEO enhancements. In this article, I\u0027ll share my personal experience with the migration process, covering the challenges faced and the steps I took to ensure a smooth transition and an optimized web presence.      p.",
        "description": "Learn how to migrate a .NET MVC CRUD application from .NET 8 to .NET 9 while enhancing SEO and improving performance.",
        "keywords": ".NET 9, migration, SampleMvcCRUD, SEO optimization, .NET MVC CRUD, compatibility, performance improvement, .NET Migration Assistance App, deprecated APIs, Visual Studio integration, NuGet packages, Docker configuration, code refactoring, meta tags, URL structures, structured data, RESTful URLs, .NET version strategy, LTS releases, STS releases, Docker containers, CI/CD pipelines, testing, unit tests, integration tests, end-to-end tests, meta tags, Open Graph, Twitter Card, Schema.org, caching, mobile-friendly design, Bootstrap.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-03-26",
        "changefreq": "monthly",
        "source": "/src/pug/articles/migrating-samplemvccrud-application-from-net-8-to-net-9.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 51,
        "Section": "Blog Management",
        "slug": "articles/automating-my-github-profile-with-the-latest-blog-posts-using-github-actions.html",
        "name": "Automating My GitHub Profile with the Latest Blog Posts Using GitHub Actions",
        "content": "Learn how to automate your GitHub profile updates with the latest blog posts using GitHub Actions and Node.js to create an RSS feed.",
        "description": "Learn how to automate your GitHub profile updates with the latest blog posts using GitHub Actions and Node.js to create an RSS feed.",
        "keywords": "GitHub Actions, automate GitHub profile, RSS feed, Node.js programming, XML file, blog posts, GitHub profile README, cron schedule, xmlstarlet, curl, workflow automation, GitHub repository, commit changes, XML parsing, awk script, runtime errors, debugging, environment files, workflow outputs, GitHub standards, automate tasks",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-04-04",
        "changefreq": "monthly",
        "source": "/src/pug/articles/automating-my-github-profile-with-the-latest-blog-posts-using-github-actions.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 52,
        "Section": "ChatGPT",
        "slug": "articles/the-brain-behind-the-jshow-trivia-demo-on-webspark-j-show-builder-gpt.html",
        "name": "The Brain Behind the JShow Trivia Demo on WebSpark J-Show Builder GPT",
        "content": "Discover the development journey of J-Show Builder GPT, an AI-powered tool that generates fun trivia games in a grid format for WebSpark’s JShow Trivia Demo.",
        "description": "Discover the development journey of J-Show Builder GPT, an AI-powered tool that generates fun trivia games in a grid format for WebSpark’s JShow Trivia Demo.",
        "keywords": "AI, J-Show Builder GPT, WebSpark, interactive trivia games, trivia quiz shows, OpenAI GPT-4, natural language understanding, JSON structure, theme-based quiz shows, interactive learning, multimedia elements, question types, real-time feedback, trivia content generation, interactive experiences, prompt engineering, ChatGPT, theme interpretation, question generation, structured grid format, trivia enthusiasts, educators, learning experiences, interactive web application demos.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-04-13",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-brain-behind-the-jshow-trivia-demo-on-webspark-j-show-builder-gpt.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 53,
        "Section": "Blog Management",
        "slug": "articles/syntax-highlighting-using-prismjs-for-xml-pug-yaml-and-csharp.html",
        "name": "Syntax Highlighting Using Prism.js for XML, PUG, YAML, and C#",
        "content": "Learn how to implement syntax highlighting for XML, PUG, YAML, and C# using Prism.js. We also explore automating the bundling process using render-scripts.js.",
        "description": "Learn how to implement syntax highlighting for XML, PUG, YAML, and C# using Prism.js. We also explore automating the bundling process using render-scripts.js.",
        "keywords": "syntax highlighting, Prism.js, XML, PUG, YAML, C#, Python, code snippets, Coy theme, language components, code blocks, render-scripts.js, Bootstrap, custom JavaScript, autoloader, theming, CSS overrides, Markdown, copy-to-clipboard, line numbers, SEO, collapsible code blocks, mobile responsive, GitHub Gists, syntax highlighting library, code readability",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2024-04-22",
        "changefreq": "monthly",
        "source": "/src/pug/articles/syntax-highlighting-using-prismjs-for-xml-pug-yaml-and-csharp.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 54,
        "Section": "Development",
        "slug": "articles/troubleshooting-and-rebuilding-my-js-dev-env-project.html",
        "name": "Troubleshooting and Rebuilding My JS-Dev-Env Project",
        "content": "A detailed guide on how I faced issues, restarted from scratch, and successfully rebuilt a JavaScript development environment using Node.js, Nodemon, ESLint, Express, and Bootstrap.",
        "description": "A detailed guide on how I faced issues, restarted from scratch, and successfully rebuilt a JavaScript development environment using Node.js, Nodemon, ESLint, Express, and Bootstrap.",
        "keywords": "JavaScript, development environment, Node.js, ESLint, Nodemon, breaking changes, dependencies, version conflicts, troubleshooting, upgrade, package.json, server, Express, EJS, Bootstrap, dynamic content, navigation, JSON, SCSS, Bootstrap Icons, Sass, npm, development process, codebase, refactor, compatibility, dependency conflicts, Node Version Manager, nvm, minimalist setup, core functionality, content management, routing, templates, static content, styling, modular, maintainable.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-05-01",
        "changefreq": "monthly",
        "source": "/src/pug/articles/troubleshooting-and-rebuilding-my-js-dev-env-project.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 55,
        "Section": "Data Science",
        "slug": "articles/data-science-for-net-developers.html",
        "name": "Data Science for NET Developers",
        "content": "Learn why a seasoned .NET developer chose the AI/ML program offered by UT Austin and Great Learning, exploring how data science is the next frontier for developers.",
        "description": "Learn why a seasoned .NET developer chose the AI/ML program offered by UT Austin and Great Learning, exploring how data science is the next frontier for developers.",
        "keywords": "Data Science, .NET Developers, AI/ML Program, University of Texas at Austin, Great Learning, machine learning algorithms, intelligent applications, automation, personalization, data-driven decision-making, recommendation systems, predictive analytics, Python fundamentals, deep learning, data-centric roles, unstructured data, customer segmentation, traditional development, exploratory, statistics, models, PromptSpark project, APIs, databases, ETL, Python, Pandas, NumPy, Scikit-learn, data manipulation, data visualization, classification, regression, clustering, Exploratory Data Analysis, EDA, ML.NET, recommendation engines, predictive systems, user engagement, business outcomes, software development, data-driven applications.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-05-10",
        "changefreq": "monthly",
        "source": "/src/pug/articles/data-science-for-net-developers.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 56,
        "Section": "Data Science",
        "slug": "articles/python-the-language-of-data-science.html",
        "name": " Python: The Language of Data Science",
        "content": "Python, Data Science, Python history, Python libraries, Pandas, NumPy, Python for C# developers",
        "description": "Python, Data Science, Python history, Python libraries, Pandas, NumPy, Python for C# developers",
        "keywords": "Python, data science, machine learning, Guido van Rossum, programming language, readability, simplicity, Zen of Python, NumPy, Pandas, Matplotlib, SciPy, TensorFlow, Scikit-learn, Jupyter Notebooks, Google Colab, AI, code assistance, Google Gemini, libraries, syntax, object-oriented, dynamic typing, code readability, exception handling, data manipulation, visualization, deep learning, AI projects, data scientists, interactive coding, cloud-based, Pythonic code, namespaces, historical milestones, Python 2.0, Python 3.0, Unicode support, list comprehensions, garbage collection, backward compatibility, C# developers, transition, variable declaration, conditional statements, loops, functions, lists, arrays, string interpolation, exception handling, classes, objects, inheritance, file handling, data exploration, visualizations, bar charts, scatter plots, Python community.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2024-05-19",
        "changefreq": "monthly",
        "source": "/src/pug/articles/python-the-language-of-data-science.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 57,
        "Section": "Case Studies",
        "slug": "articles/fixing-a-runaway-nodejs-recursive-folder-issue.html",
        "name": "Fixing a Runaway Node.js Recursive Folder Issue",
        "content": "Learn how to fix a runaway Node.js program that creates near-infinite recursive directories. Includes Windows C\u002B\u002B program to clean up",
        "description": "Learn how to fix a runaway Node.js program that creates near-infinite recursive directories. Includes Windows C\u002B\u002B program to clean up",
        "keywords": "Node.js, recursive folders, Windows, C\u002B\u002B solution, long path support, WIN32 API, directory deletion, file path limitations, Command Prompt, PowerShell, Bash Shell, Robocopy, recursive directories, file system, path length, directory structure, delete folders, C\u002B\u002B program, WIN32 API, directory cleanup, file management, nested directories, Windows Registry, Group Policy Editor, long paths, file operations, Windows tools, file attributes, AzureDevOps, runaway-node.",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-05-28",
        "changefreq": "monthly",
        "source": "/src/pug/articles/fixing-a-runaway-nodejs-recursive-folder-issue.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 58,
        "Section": "Data Science",
        "slug": "articles/exploring-nutritional-data-using-pca-and-k-means-clustering.html",
        "name": "Exploring Nutritional Data Using K-means Clustering",
        "content": "A Data Scientist explores nutritional data patterns using K-means Clustering on Google Colab, segmenting foods by nutrient content.",
        "description": "A Data Scientist explores nutritional data patterns using K-means Clustering on Google Colab, segmenting foods by nutrient content.",
        "keywords": "k-means clustering, unsupervised learning, clustering algorithm, centroids, data points, customer segmentation, market analysis, image recognition, medical diagnostics, partitioning data, clusters, similarities, variance, student grades, random initialization, sum of squared errors, SSE, elbow method, silhouette score, scaling data, Euclidean distance, non-spherical clusters, DBSCAN, outliers, dimensionality reduction, Principal Component Analysis, PCA, principal components, eigenvalues, eigenvectors, Google Colab, Jupyter Notebook, dendrogram, elbow curve, inertia, nutrient data, Kaggle, data exploration, machine learning, data analysis, recommendation systems, visualization, data patterns, nutrient segmentation, optimal clustering, cluster assignment, centroid update, data scaling, data transformation, pattern recognition.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-06-06",
        "changefreq": "monthly",
        "source": "/src/pug/articles/exploring-nutritional-data-using-pca-and-k-means-clustering.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 59,
        "Section": "Data Science",
        "slug": "articles/exploratory-data-analysis-eda-using-python.html",
        "name": "Exploratory Data Analysis (EDA) Using Python",
        "content": "An in-depth guide to Data Sanity checks and Exploratory Data Analysis (EDA) using Python.",
        "description": "An in-depth guide to Data Sanity checks and Exploratory Data Analysis (EDA) using Python.",
        "keywords": "Exploratory Data Analysis, EDA, data sanity checks, Python, data analysis, machine learning, data cleaning, preprocessing, Kaggle, Google Colab, Jupyter notebook, nutrient patterns, datasets, healthcare, finance, nutrition, protein, fat, vitamin C, fiber, pandas, pandas.read_csv, df.head, df.tail, df.info, df.describe, Google Drive, data loading, data exploration, dataset structure, unique values, missing values, duplicates, data integrity, data types, outliers, IQR, boxplots, scatter plots, univariate analysis, bivariate analysis, multivariate analysis, histograms, bar plots, frequency tables, correlation matrices, heatmaps, cluster analysis, dimensionality reduction, PCA, t-SNE, feature selection, time series analysis, data cleaning, data preprocessing, data visualization, feature engineering, statistical methods, data integrity, data validation, automation, data distribution, central tendency, variability, descriptive statistics, skewness, kurtosis, KDE plot, correlation coefficient, correlation matrix, pair plot, scatter plot, cluster analysis, KMeans, DBSCAN, ARIMA, time series forecasting, chi-square test, data insights, data relationships, data integrity, data validation, data visualization, feature relationships, data trends, data patterns, data anomalies, data preprocessing, data cleaning, data quality, data analysis pipeline, data exploration, data insights, data modeling, data science techniques, data analysis techniques.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2024-06-15",
        "changefreq": "monthly",
        "source": "/src/pug/articles/exploratory-data-analysis-eda-using-python.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 60,
        "Section": "Blog Management",
        "slug": "articles/canonical-url-troubleshooting-for-static-web-apps.html",
        "name": "Canonical URL Troubleshooting for Static Web Apps",
        "content": "Learn how to manage canonical URLs for static web apps using Azure and Cloudflare for SEO optimization.",
        "description": "Learn how to manage canonical URLs for static web apps using Azure and Cloudflare for SEO optimization.",
        "keywords": "canonical URL, SEO optimization, static web apps, duplicate content, Azure Static Web Apps, Cloudflare, URL variations, canonical tags, staticwebapp.config.json, URL redirection, GitHub repository, DNS, page rules, 301 Permanent Redirect, URL patterns, Cloudflare URL Forwarding",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-06-24",
        "changefreq": "monthly",
        "source": "/src/pug/articles/canonical-url-troubleshooting-for-static-web-apps.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 61,
        "Section": "Blog Management",
        "slug": "articles/developing-markhazletoncom-tools-and-approach.html",
        "name": "Developing MarkHazleton.com: Tools and Approach",
        "content": "An in-depth look into the technologies and development process behind MarkHazleton.com. Discover the tools and frameworks used to create this site.",
        "description": "An in-depth look into the technologies and development process behind MarkHazleton.com. Discover the tools and frameworks used to create this site.",
        "keywords": "MarkHazleton.com, tools, technologies, development, efficient management, static site, Node.js, npm, Start Bootstrap Resume, Pug, SCSS, templating, styling, local development, deployment automation, package.json, GitHub Actions, Azure Static Web Apps, Visual Studio Code, SB UI Kit Pro, Bootstrap, GitHub, Cloudflare, Screaming Frog SEO Spider, SEO, SCSS, Sass, Autoprefixer, CSSnano, minification, site performance, modular SCSS, continuous integration, CI/CD pipeline, scalability, maintainability, performance, optimization, web development.",
        "img_src": "assets/img/ScotlandHighlands.jpg",
        "lastmod": "2024-07-03",
        "changefreq": "monthly",
        "source": "/src/pug/articles/developing-markhazletoncom-tools-and-approach.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 62,
        "Section": "Project Mechanics",
        "slug": "projectmechanics/solution-architect-technology-decisions-that-impact-business.html",
        "name": "Solution Architect Technology Decisions that Impact Business",
        "content": "A comprehensive guide for solution architects on aligning technology decisions with business goals and outcomes.",
        "description": "A comprehensive guide for solution architects on aligning technology decisions with business goals and outcomes.",
        "keywords": "Solution Architect, technology choices, business outcomes, Project Mechanics, structured project management, adaptive problem-solving, scalable systems, business objectives, Program Management Office, PMO, technical requirements, business constraints, cost optimization, stakeholder communication, technical success, senior technical role, IT solutions, industry best practices, scalability, security, system integration, architectural blueprints, technology evaluation, web, mobile, API, DevOps, innovation, practical execution, risk mitigation, technical sustainability, business strategy, strategic goals, technology enhancement, operational efficiency, trusted advisor, financial investments, high-stakes decisions, technology recommendations, efficiency, scalability, innovation, technical and business considerations, operational efficiency, business strategy, technology specialization, generalization, technical stack, cloud infrastructure, security, holistic solutions, strategic oversight, scalability, integration, Life Long Learning, specialization vs. generalization, cost considerations, return on investment, ROI, total cost of ownership, technology lifecycle, cost implications, staffing, training, maintenance, future scalability, staffing and skills, HR collaboration, technical debt, skill set, re-skilling, recruitment, modern technologies, team satisfaction, risk management, security, compliance, performance, risk mitigation, regulatory requirements, data breaches, stakeholder communication, transparency, long-term risks, technology obsolescence, multi-headed hydra, global system outages, interconnected business, stakeholder engagement, business alignment, continuous learning, collaboration, specialization, generalization, business alignment.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-07-12",
        "changefreq": "monthly",
        "source": "/src/pug/projectmechanics/solution-architect-technology-decisions-that-impact-business.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 63,
        "Section": "ReactSpark",
        "slug": "articles/building-my-first-react-site-using-vite.html",
        "name": " Building My First React Site Using Vite",
        "content": "Learn how to quickly build and deploy a React site using Vite and GitHub Pages, including troubleshooting common issues like CORS",
        "description": "Learn how to quickly build and deploy a React site using Vite and GitHub Pages, including troubleshooting common issues like CORS",
        "keywords": "React, TypeScript, Vite, GitHub Pages, React Native, web APIs, Microsoft SQL Server, Azure Cloud Services, component-based architecture, type safety, scalable applications, maintainable applications, project scaffolding, npm, React components, RSS feed, DOMParser, GitHub Actions, hot module replacement, TypeScript concepts, type annotations, type inference, state management, API interactions, typed parameters, optional parameters, default parameters, interfaces, type aliases, union types, intersection types, generics, type assertions, enums, props, React Router, HashRouter, Link component, environment variables, dotenv, base path, deployment.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-07-21",
        "changefreq": "monthly",
        "source": "/src/pug/articles/building-my-first-react-site-using-vite.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 64,
        "Section": "ReactSpark",
        "slug": "articles/adding-weather-component-a-typescript-learning-journey.html",
        "name": "Adding Weather Component: A TypeScript Learning Journey",
        "content": "Learn how to integrate a weather forecast and map feature using TypeScript in a React Native application, while practicing key TypeScript concepts like typed components and error handling.",
        "description": "Learn how to integrate a weather forecast and map feature using TypeScript in a React Native application, while practicing key TypeScript concepts like typed components and error handling.",
        "keywords": "TypeScript, React, React Native, Weather Forecast, GitHub, GitHub Pages, Profile Application, Static Types, Data Fetching, State Management, UI Component, Typed React Components, Interface Definitions, Strongly Typed State, Type-Safe Event Handling, Asynchronous Data Fetching, Type Checking, Error Handling, Debugging, Functional Component, useState, Event Handling, API Response, Conditional Rendering, Error Messages, Custom Hooks, Generic Types, Redux",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-07-30",
        "changefreq": "monthly",
        "source": "/src/pug/articles/adding-weather-component-a-typescript-learning-journey.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 65,
        "Section": "Case Studies",
        "slug": "articles/windows-to-mac-broadening-my-horizons.html",
        "name": "Windows to Mac: Broadening My Horizons",
        "content": "My journey from Windows to macOS, learning to use a MacBook Pro and enhancing my tech toolkit.",
        "description": "My journey from Windows to macOS, learning to use a MacBook Pro and enhancing my tech toolkit.",
        "keywords": "MacBook Pro, macOS, Windows, technology toolkit, Retina display, Dock, Finder, App Store, Command shortcuts, gestures, trackpad, Edge, Chrome, Firefox, Visual Studio Code, Azure, Dell docking station, KVM switch, Microsoft Teams, Azure DevOps, GitHub, Spotlight, Xcode, Swift, Homebrew, Node.js, ChatGPT, productivity, keyboard shortcuts, trackpad functions, dual ecosystems, development tools.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-08-08",
        "changefreq": "monthly",
        "source": "/src/pug/articles/windows-to-mac-broadening-my-horizons.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 66,
        "Section": "PromptSpark",
        "slug": "articles/interactive-chat-in-promptspark-with-signalr-and-semantic-kernel-chat-completions.html",
        "name": "Interactive Chat in PromptSpark With SignalR and Semantic Kernel Chat Completions",
        "content": "Guide to implementing a real-time, AI-driven chat application in PromptSpark using ASP.NET SignalR and OpenAI GPT via Semantic Kernel.",
        "description": "Guide to implementing a real-time, AI-driven chat application in PromptSpark using ASP.NET SignalR and OpenAI GPT via Semantic Kernel.",
        "keywords": "SignalR, OpenAI, GPT models, Semantic Kernel, ASP.NET, real-time chat, AI-driven, chat completions, React Native, interactive chat, user-centric applications, continuous learning, agile approach, integration, real-time functionality, intelligent responses, development environment, API keys, logging configuration, routing, middleware, ChatHub, ConcurrentDictionary, streaming responses, user interface, front-end, Bootstrap styling, JavaScript, real-time messaging, conversation ID, testing, troubleshooting, scaling, Azure SignalR Service, multilingual support, sentiment analysis, adaptive chat experiences.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-08-17",
        "changefreq": "monthly",
        "source": "/src/pug/articles/interactive-chat-in-promptspark-with-signalr-and-semantic-kernel-chat-completions.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 67,
        "Section": "ReactSpark",
        "slug": "articles/building-real-time-chat-with-react-signalr-and-markdown-streaming.html",
        "name": "Building Real-Time Chat with React, SignalR, and Markdown Streaming",
        "content": "Explore building a real-time React chat app with TypeScript, SignalR for live messaging, and streaming Markdown rendering.",
        "description": "Explore building a real-time React chat app with TypeScript, SignalR for live messaging, and streaming Markdown rendering.",
        "keywords": "React, SignalR, Markdown, real-time chat, TypeScript, Vite, PromptSpark, HubConnection, Bootstrap, streaming content, chat UI, bot responses, customizable tones, incremental loading, FlatList, error management, Bootstrap Icons, responsive design, content streaming, bidirectional messaging, dynamic bot personalities.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-08-26",
        "changefreq": "monthly",
        "source": "/src/pug/articles/building-real-time-chat-with-react-signalr-and-markdown-streaming.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 68,
        "Section": "PromptSpark",
        "slug": "articles/workflow-driven-chat-applications-powered-by-adaptive-cards.html",
        "name": "Workflow-Driven Chat Applications Powered by Adaptive Cards",
        "content": "Learn how to design workflow-driven chat applications powered by Adaptive Cards, enhancing AI interactivity and structured conversations.",
        "description": "Learn how to design workflow-driven chat applications powered by Adaptive Cards, enhancing AI interactivity and structured conversations.",
        "keywords": "chat applications, artificial intelligence, AI, intelligent interaction, Adaptive Cards, workflow-driven processes, UI components, business goals, context-aware interactions, structured, goal-oriented chat applications, healthcare, productivity, user experience, structured processes, cognitive effort, engagement, user interactions, predefined workflows, coffee brewing workflow, JSON workflow, interactive format, logical progression, user preferences, actionable tips, dynamic content updates, data visualization, workflow-driven design, AI interactions, nodes and edges, dynamic adaptation, JSON-based configuration, intelligent applications, system requirements, compliance standards, data validation, error handling, Co-Pilot, structured conversations, interactive elements, cross-platform functionality, scalable, OpenAI integration, personalized responses, support bot, data collection tool, guided interaction system.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-09-04",
        "changefreq": "monthly",
        "source": "/src/pug/articles/workflow-driven-chat-applications-powered-by-adaptive-cards.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 69,
        "Section": "Case Studies",
        "slug": "articles/using-notebooklm-clipchamp-and-chatgpt-for-podcasts.html",
        "name": "Using NotebookLM, Clipchamp, and ChatGPT for Podcasts",
        "content": "Learn how to use NotebookLM, Microsoft Clipchamp, and ChatGPT to create engaging podcast episodes for the Deep Dive playlist.",
        "description": "Learn how to use NotebookLM, Microsoft Clipchamp, and ChatGPT to create engaging podcast episodes for the Deep Dive playlist.",
        "keywords": "NotebookLM, Clipchamp, ChatGPT, podcast production, AI-driven podcasts, Google\u0027s NotebookLM, Microsoft Clipchamp, AI research assistant, note-taking, research assistant, audio-based discussions, podcast episodes, AI-powered organization, AI summarization, personalized AI model, audio overview, podcast-style audio summaries, high-quality podcast episodes, engaging content, workflow integration, synthesizing complex information, notebook guide, audio overview generation, podcast creation, visual assets, editing in Clipchamp, publishing podcasts, SEO-optimized titles, content quality enhancement.",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-09-13",
        "changefreq": "monthly",
        "source": "/src/pug/articles/using-notebooklm-clipchamp-and-chatgpt-for-podcasts.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 70,
        "Section": "Case Studies",
        "slug": "articles/eds-super-bowl-commercials.html",
        "name": "EDS Super Bowl Commercials",
        "content": "Explore the history and impact of EDS’s groundbreaking Super Bowl ads from 2000-2001, showcasing IT project management challenges.",
        "description": "Explore the history and impact of EDS’s groundbreaking Super Bowl ads from 2000-2001, showcasing IT project management challenges.",
        "keywords": "EDS Super Bowl commercials, IT project management, storytelling, cultural significance, humor, metaphors, IT professionals, chaos, challenges, Fallon agency, Cat Herders, Airplane, Running with the Squirrels, coordination challenges, simultaneous development, business continuity, agility, digital economy, creativity, advertising campaigns, brand awareness, project alignment, innovation, operational stability, technological change, presentations, training materials, project planning, creativity, complex concepts.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-09-22",
        "changefreq": "monthly",
        "source": "/src/pug/articles/eds-super-bowl-commercials.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 71,
        "Section": "Case Studies",
        "slug": "articles/open-ai-sora-first-impressions.html",
        "name": "Open AI Sora First Impressions",
        "content": "Explore OpenAI Sora, an AI-driven video generation platform, and its impact on creative industries",
        "description": "Explore OpenAI Sora, an AI-driven video generation platform, and its impact on creative industries",
        "keywords": "OpenAI Sora, AI-driven video generation, text-to-video, video content, AI platform, seamless animations, video creation, artificial intelligence, video production, creative customization, high-resolution outputs, intuitive interface, video automation, video editing, marketing, education, entertainment, professional-grade video, diffusion transformer architecture, denoising latent diffusion model, video prompts, video outputs, video customization, video tools, video training data, video challenges, video limitations, video technology, video capabilities, video enhancements, video features, video insights, video performance, video accessibility, video future, video integration, video updates.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-10-01",
        "changefreq": "monthly",
        "source": "/src/pug/articles/open-ai-sora-first-impressions.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 72,
        "Section": "Data Science",
        "slug": "articles/an-introduction-to-neural-networks.html",
        "name": "An Introduction to Neural Networks",
        "content": "A beginner-friendly introduction to neural networks, explaining key concepts and their role in artificial intelligence.",
        "description": "A beginner-friendly introduction to neural networks, explaining key concepts and their role in artificial intelligence.",
        "keywords": "neural networks, introduction, AI, machine learning, data science, deep learning",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-10-10",
        "changefreq": "monthly",
        "source": "/src/pug/articles/an-introduction-to-neural-networks.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 73,
        "Section": "PromptSpark",
        "slug": "articles/creating-law-and-order-episode-generator.html",
        "name": "Creating Law and Order Episode Generator",
        "content": "Learn how to use PromptSpark to build a GPT that generates Law \u0026 Order episodes from Reddit thread analysis",
        "description": "Learn how to use PromptSpark to build a GPT that generates Law \u0026 Order episodes from Reddit thread analysis",
        "keywords": "PromptSpark, GPT, Law and Order episodes, Reddit threads, AI storytelling, system prompt creation, AI prompts",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-10-19",
        "changefreq": "monthly",
        "source": "/src/pug/articles/creating-law-and-order-episode-generator.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 74,
        "Section": "PromptSpark",
        "slug": "articles/i-know-ap-the-transformative-power-of-mcp.html",
        "name": "I Know AP: The Transformative Power of MCP",
        "content": "Explore how the Model Context Protocol (MCP) enables AI to adapt dynamically, transforming repetitive tasks and business intelligence processes.",
        "description": "Explore how the Model Context Protocol (MCP) enables AI to adapt dynamically, transforming repetitive tasks and business intelligence processes.",
        "keywords": "MCP, Model Context Protocol, AI agents, business adaptation, real-time learning, dynamic adaptability, seamless workflow integration, AI systems, live data streams, structured databases, application workflows, contextual learning, business workflows, efficiency, adaptability, repetitive tasks, decision-making, business intelligence, data security, unbiased datasets, process improvements, innovation, industry adoption, AI development platforms, standardization, simplification, security, control, open-source, community contributions, collaboration, Anthropic, AI integration.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-10-28",
        "changefreq": "monthly",
        "source": "/src/pug/articles/i-know-ap-the-transformative-power-of-mcp.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 75,
        "Section": "Project Mechanics",
        "slug": "articles/adapting-with-purpose-lifelong-learning-in-the-ai-age.html",
        "name": "Adapting with Purpose: Lifelong Learning in the AI Age",
        "content": "Reflections on the importance of lifelong learning and adaptability in an AI-driven world. Explore how AI enhances and transforms lifelong learning.",
        "description": "Reflections on the importance of lifelong learning and adaptability in an AI-driven world. Explore how AI enhances and transforms lifelong learning.",
        "keywords": "AI, lifelong learning, adaptability, generalist, specialist, cross-disciplinary, innovation, versatility, deep expertise, technical proficiency, niche fields, adaptability, learning tools, AI technology, continuous pursuit of knowledge, formal education, self-directed study, practical experience, AI age, AI as an enabler, GitHub Co-Pilot, Chat GPT, Gemini, Colab notebooks, ethical implications",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-11-06",
        "changefreq": "monthly",
        "source": "/src/pug/articles/adapting-with-purpose-lifelong-learning-in-the-ai-age.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 76,
        "Section": "Blog Management",
        "slug": "articles/getting-started-with-pug-history-background-and-future.html",
        "name": "Getting Started with PUG - History, Background, and Future",
        "content": "Learn the history, background, and future prospects of PUG, a high-performance template engine for Node.js. Discover its features, community, and maintenance.",
        "description": "Learn the history, background, and future prospects of PUG, a high-performance template engine for Node.js. Discover its features, community, and maintenance.",
        "keywords": "software development, pragmatic approach, evolutionary progress, incremental improvements, revolutionary ideas, maintenance, stakeholders, legacy code, development roadmap, calculated risk-taking, learning from failure, user experience, market demands, iterative process, stability, maintainability, business agility, Azure Front Door, microservices, architectural improvements, traffic routing, scalability, resilience, continuous improvement, technical debt",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-11-15",
        "changefreq": "monthly",
        "source": "/src/pug/articles/getting-started-with-pug-history-background-and-future.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 77,
        "Section": "Development",
        "slug": "articles/generate-wiki-documentation-from-your-code-repository.html",
        "name": "Generate Wiki Documentation from Your Code Repository",
        "content": "Learn how to create a tool to generate detailed wiki documentation from your code repository. This is a step-by-step guide with best practices for developers.",
        "description": "Learn how to create a tool to generate detailed wiki documentation from your code repository. This is a step-by-step guide with best practices for developers.",
        "keywords": "DocSpark, code repository, documentation, developers, .NET, Markdown, JSON, API documentation, class details, method summaries, codebase, XML comments, namespaces, routes, inheritance, metadata, integrations, automate, consistency, developer-friendly, FileService, SyntaxAnalysisService, MarkdownGenerator, JSONExporter, API controllers, route prefixes, public API methods, CI/CD pipeline, Microsoft.CodeAnalysis, Roslyn, syntax analysis, route generation, HTTP verbs, IntelliSense, Visual Studio, code analyzers, GitHub Copilot, AI tools, CodeRush, Refactor, productivity.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-11-24",
        "changefreq": "monthly",
        "source": "/src/pug/articles/generate-wiki-documentation-from-your-code-repository.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 78,
        "Section": "Data Science",
        "slug": "articles/computer-vision-in-machine-learning.html",
        "name": "Computer Vision in Machine Learning",
        "content": "Explore the transformative role of computer vision in machine learning, its applications, and future potential",
        "description": "Explore the transformative role of computer vision in machine learning, its applications, and future potential",
        "keywords": "pragmatic approach, software development, evolutionary progress, incremental improvements, revolutionary ideas, legacy code, disruption, chaos, unintended consequences, calculated risk-taking, learning from failure, stability, maintainability, user experience, iterative process, market demands, forced evolution, Duke Nukem Forever, Betamax vs VHS, innovation, business agility, Azure Front Door, microservices, monolithic application, traffic routing, scalability, resilience, business continuity, technical debt, sustainable outcomes",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-12-03",
        "changefreq": "monthly",
        "source": "/src/pug/articles/computer-vision-in-machine-learning.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 79,
        "Section": "Data Science",
        "slug": "articles/harnessing-nlp-concepts-and-real-world-impact.html",
        "name": "Harnessing NLP: Concepts and Real-World Impact",
        "content": "Explore the transformative power of Natural Language Processing (NLP) in today’s tech-driven world. Dive into key concepts and real-world applications that illustrate its role in enhancing business operations and enriching consumer experiences",
        "description": "Explore the transformative power of Natural Language Processing (NLP) in today’s tech-driven world. Dive into key concepts and real-world applications that illustrate its role in enhancing business operations and enriching consumer experiences.",
        "keywords": "Natural Language Processing, NLP, artificial intelligence, machine learning, sentiment analysis, virtual assistants, text preprocessing, tokenization, stemming, language modeling, machine translation, speech recognition, Large Language Models, LLMs, GPT-3, GPT-4, BERT, self-attention mechanisms, transformers, deep learning, computational linguistics, statistical methods, sentiment analysis, healthcare, finance, customer service, e-commerce, legal, education, marketing, word embeddings, Word2Vec, Turing Test, ELIZA, SHRDLU, Hidden Markov Models, statistical NLP, Karen Spärck Jones, machine learning revolution, transformers, pretraining, fine-tuning, GPT-3, GPT-4, multimodal capabilities, data science, AI, TensorFlow, PyTorch, virtual assistants.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2024-12-12",
        "changefreq": "monthly",
        "source": "/src/pug/articles/harnessing-nlp-concepts-and-real-world-impact.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 80,
        "Section": "Case Studies",
        "slug": "articles/riffusion-ai-revolutionizing-music-creation.html",
        "name": "Riffusion AI: Revolutionizing Music Creation",
        "content": "In the digital era, artificial intelligence is rapidly changing the creative landscape, and the music industry is at the forefront of this transformation. ",
        "description": "Explore how Riffusion AI is transforming the music industry with groundbreaking technology.",
        "keywords": "Riffusion, AI music generator, diffusion models, spectrogram synthesis, music creation, AI-generated music, text prompts, audio synthesis, image generation, Fuzz model, personalized tracks, music industry, AI vocalists, music production, innovation, democratization, creative landscape, digital media, artistic expression, independent artists, music technology, AI platforms, personalized music, music innovation, creative boundaries.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2024-12-21",
        "changefreq": "monthly",
        "source": "/src/pug/articles/riffusion-ai-revolutionizing-music-creation.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 81,
        "Section": "Case Studies",
        "slug": "articles/the-creation-of-sharesmallbizcom-a-platform-for-small-business-success.html",
        "name": "The Creation of ShareSmallBiz.com: A Platform for Small Business Success",
        "content": "Discover how ShareSmallBiz.com is transforming small business marketing through collaboration and shared resources.",
        "description": "Discover how ShareSmallBiz.com is transforming small business marketing through collaboration and shared resources.",
        "keywords": "small business success, ShareSmallBiz.com, collaboration, digital marketing, community-driven platform, small business marketing, strategic partnerships, networking opportunities, long-term growth, sustainable business practices, entrepreneurial journey, organic growth, trusted entrepreneurs, marketplace for small businesses, community support, innovation, resilience, business ecosystem, strategic relationships, economic diversity, business growth, mutual support, shared marketing efforts, small business challenges, business operations, community vitality, economic impact, business collaboration, small business resources, networking events, business solutions, business partnerships, community-driven growth, entrepreneurial insights, business ecosystem, support systems, shared success",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2024-12-30",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-creation-of-sharesmallbizcom-a-platform-for-small-business-success.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 82,
        "Section": "Case Studies",
        "slug": "articles/kendrick-lamars-super-bowl-lix-halftime-show-a-masterpiece-of-metaphors.html",
        "name": "Kendrick Lamar\u0027s Super Bowl LIX Halftime Show: A Masterpiece of Metaphors",
        "content": "Kendrick Lamar’s Super Bowl LIX halftime performance delivered a profound societal commentary through metaphorical visuals and thought-provoking stage design.",
        "description": "Kendrick Lamar’s Super Bowl LIX halftime performance delivered a profound societal commentary through metaphorical visuals and thought-provoking stage design.",
        "keywords": "Kendrick Lamar, Super Bowl LIX, halftime show, metaphors, societal issues, game metaphor, PlayStation stage design, Squid Game card, manipulation, control, Squabble Up, puppet strings, public perception, dancers, choreography, American society, Samuel L. Jackson, Uncle Sam, Serena Williams, media scrutiny, minimalist performance, societal systems, individuality, awareness, critique, authenticity, manipulation, societal expectations, media-driven narratives.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2025-01-08",
        "changefreq": "monthly",
        "source": "/src/pug/articles/kendrick-lamars-super-bowl-lix-halftime-show-a-masterpiece-of-metaphors.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 83,
        "Section": "ChatGPT",
        "slug": "articles/ai-and-critical-thinking-in-software-development.html",
        "name": "AI and Critical Thinking in Software Development",
        "content": "Explore the impact of AI on critical thinking in software development and discover strategies to balance AI efficiency with human creativity.",
        "description": "Explore the impact of AI on critical thinking in software development and discover strategies to balance AI efficiency with human creativity.",
        "keywords": "AI, critical thinking, software development, automation, human insight, GitHub Copilot, ChatGPT, productivity, cognitive engagement, problem-solving skills, Microsoft study, generative AI, decision-making, education, creativity, strategic endeavors, efficiency, AI-driven systems, cognitive atrophy, over-reliance, human oversight, collaboration, ethical guidelines, human-in-the-loop, human-on-the-loop, AI-assisted decision making, biases, critical thinking development, AI strengths and limitations, critical thinking skills, educational strategies, media literacy, intellectual humility, symbiosis, innovation.",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2025-01-17",
        "changefreq": "monthly",
        "source": "/src/pug/articles/ai-and-critical-thinking-in-software-development.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 84,
        "Section": "Data Science",
        "slug": "articles/ai-assisted-development-claude-and-github-copilot.html",
        "name": "AI-Assisted Development: Claude and GitHub Copilot",
        "content": "Discover how AI-assisted development tools like Claude and GitHub Copilot are transforming the software development lifecycle",
        "description": "Discover how AI-assisted development tools like Claude and GitHub Copilot are transforming the software development lifecycle",
        "keywords": "AI-assisted development, Claude, GitHub Copilot, software development, AI-powered coding, AI tools, code completion, code snippets, boilerplate reduction, IDE, conversational AI, debugging, brainstorming, Claude Sonnet, code structures, development lifecycle, design, prototyping, problem-solving, code review, developer productivity, error reduction, code quality, collaboration, technical features, Codex model, programming languages, syntax, semantics, subscription plans, Copilot Chat, Visual Studio Code, Visual Studio 2022, AI integration, AI environments, AI assistance, democratizing coding.",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2025-01-26",
        "changefreq": "monthly",
        "source": "/src/pug/articles/ai-assisted-development-claude-and-github-copilot.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 85,
        "Section": "ChatGPT",
        "slug": "articles/the-impact-of-input-case-on-llm-categorization.html",
        "name": "The Impact of Input Case on LLM Categorization",
        "content": "Discover how input case affects tokenization and categorization in Large Language Models (LLMs). Understand case sensitivity in NLP tasks and model robustness.",
        "description": "Discover how input case affects tokenization and categorization in Large Language Models (LLMs). Understand case sensitivity in NLP tasks and model robustness.",
        "keywords": "LLM, categorization, case sensitivity, tokenization, NLP, input case, case-sensitive, case-insensitive, prompt engineering, sentiment analysis, topic classification, BERT, GPT, transformers, subword tokenizers, token IDs, embedding vectors, BPE tokenization, byte-pair encoding, data augmentation, mixed-case samples, preprocessing, robust agents, sentiment detection, acronyms, proper nouns, Named Entity Recognition, case normalization, text preprocessing, AI utility, model performance, classification decisions, internal representations, case changes, subword fragments, categorization tasks.",
        "img_src": "assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2025-02-04",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-impact-of-input-case-on-llm-categorization.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 86,
        "Section": "Case Studies",
        "slug": "articles/pedernales-cellars-winery-in-texas-hill-country.html",
        "name": "Pedernales Cellars Winery in Texas Hill Country",
        "content": "Discover the rich history, sustainable practices, and winemaking philosophy of Pedernales Cellars, a leading Texas Hill Country winery",
        "description": "Discover the rich history, sustainable practices, and winemaking philosophy of Pedernales Cellars, a leading Texas Hill Country winery",
        "keywords": "Pedernales Cellars, Texas wineries, sustainable winemaking, Hill Country wine, Tempranillo, Viognier",
        "img_src": "assets/img/ScotlandRainbow.jpg",
        "lastmod": "2025-02-13",
        "changefreq": "monthly",
        "source": "/src/pug/articles/pedernales-cellars-winery-in-texas-hill-country.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 87,
        "Section": "ReactSpark",
        "slug": "articles/reactspark-a-comprehensive-portfolio-showcase.html",
        "name": "ReactSpark A Comprehensive Portfolio Showcase",
        "content": "ReactSpark is a modern, responsive portfolio website meticulously crafted using React 19 with TypeScript, and built with the lightning-fast Vite build tool. Serving as a tangible demonstration of contemporary web development best practices, ReactSpark also functions as a robust reference implementation for building applications with React. As an integral component of the broader WebSpark suite, ReactSpark effectively illustrates how dynamic web frontends can be seamlessly powered by well-structured APIs. The full source code for the ReactSparkPortfolio is openly available on GitHub. You can also view the live application on GitHub Pages.",
        "description": "ReactSpark is a modern, responsive portfolio website meticulously crafted using React 19 with TypeScript, and built with the lightning-fast Vite build tool. Serving as a tangible demonstration of contemporary web development best practices, ReactSpark also functions as a robust reference implementation for building applications with React. As an integral component of the broader WebSpark suite, ReactSpark effectively illustrates how dynamic web frontends can be seamlessly powered by well-structured APIs. The full source code for the ReactSparkPortfolio is openly available on GitHub. You can also view the live application on GitHub Pages.",
        "keywords": "React 19, TypeScript, Vite, portfolio website, WebSpark, responsive design, modern web development, component-based architecture, React Context API, Bootstrap 5, dark mode, theme toggle, React Router, Axios, web development best practices",
        "img_src": "assets/img/ArgostoliGreeceBeach.jpg",
        "lastmod": "2025-02-22",
        "changefreq": "monthly",
        "source": "/src/pug/articles/reactspark-a-comprehensive-portfolio-showcase.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 88,
        "Section": "PromptSpark",
        "slug": "articles/the-new-era-of-individual-agency-how-ai-tools-are-empowering-the-self-starter.html",
        "name": "The New Era of Individual Agency: How AI Tools Are Empowering the Self-Starter",
        "content": "Explore how AI tools are enabling unprecedented individual agency and democratizing capabilities once reserved for specialists.",
        "description": "Explore how AI tools are enabling unprecedented individual agency and democratizing capabilities once reserved for specialists.",
        "keywords": "AI, artificial intelligence, personal agency, entrepreneurship, self-starter, technology, democratization, productivity, Mark Hazleton",
        "img_src": "assets/img/sardinasunset.jpg",
        "lastmod": "2025-03-03",
        "changefreq": "monthly",
        "source": "/src/pug/articles/the-new-era-of-individual-agency-how-ai-tools-are-empowering-the-self-starter.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 89,
        "Section": "Case Studies",
        "slug": "articles/from-readme-to-reality-teaching-an-agent-to-bootstrap-a-ui-theme.html",
        "name": "From README to Reality: Teaching an Agent to Bootstrap a UI Theme",
        "content": "How I used a smart NuGet package README and Visual Studio Code’s agent mode to auto-install and configure a UI theme. See the live demo using WebSpark.Bootswatch.",
        "description": "How I used a smart NuGet package README and Visual Studio Code’s agent mode to auto-install and configure a UI theme. See the live demo using WebSpark.Bootswatch.",
        "keywords": "",
        "img_src": "assets/img/painteddesert.jpg",
        "lastmod": "2025-03-12",
        "changefreq": "weekly",
        "source": "/src/pug/articles/from-readme-to-reality-teaching-an-agent-to-bootstrap-a-ui-theme.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 90,
        "Section": "Current Events",
        "slug": "articles/nuget-gallery-developer-and-educator.html",
        "name": "My Journey as a NuGet Gallery Developer and Educator",
        "content": "Reflecting on my experience creating WebSpark.HttpClientUtility and educating developers about NuGet package best practices.",
        "description": "Mark Hazleton shares his journey as a NuGet package developer, creator of WebSpark.HttpClientUtility, and educator on NuGet best practices for the .NET community.",
        "keywords": "NuGet packages, WebSpark.HttpClientUtility, .NET development, package creation, open source, HttpClient, Polly resilience patterns, developer education, package best practices",
        "img_src": "assets/img/NewHampshire-Fall.jpg",
        "lastmod": "2025-03-21",
        "changefreq": "weekly",
        "source": "/src/pug/articles/nuget-gallery-developer-and-educator.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 91,
        "Section": "Case Studies",
        "slug": "articles/building-artspark-where-ai-meets-art-history.html",
        "name": "Building ArtSpark: Where AI Meets Art History",
        "content": "How I created an AI-powered platform that lets you chat with centuries-old artworks using .NET 9, Microsoft Semantic Kernel, and GPT-4 Vision.",
        "description": "Discover how I built ArtSpark, an innovative AI platform that enables conversations with museum artworks. Learn about the technical implementation using .NET 9, Microsoft Semantic Kernel, GPT-4 Vision, and the Art Institute of Chicago API to create immersive cultural experiences.",
        "keywords": "ArtSpark, AI art platform, GPT-4 Vision, Microsoft Semantic Kernel, .NET 9, Art Institute of Chicago API, cultural technology, museum AI, conversational AI, art history, IIIF, OpenAI, machine learning",
        "img_src": "assets/img/MarkHazleton-ArtSpark-ChatWithArtCurator.png",
        "lastmod": "2025-03-30",
        "changefreq": "weekly",
        "source": "/src/pug/articles/building-artspark-where-ai-meets-art-history.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 92,
        "Section": "Development",
        "slug": "articles/architecting-agentic-services-in-net-9-semantic-kernel-enterprise-ai-architecture.html",
        "name": "Architecting Agentic Services in .NET 9: Semantic Kernel | Enterprise AI Architecture",
        "content": "Comprehensive architectural guide for implementing agentic AI services in .NET 9 using Microsoft Semantic Kernel. Learn instruction engineering, security patterns, and enterprise-ready implementation strategies.",
        "description": "Comprehensive architectural guide for implementing agentic AI services in .NET 9 using Microsoft Semantic Kernel. Learn instruction engineering, security patterns, and enterprise-ready implementation strategies.",
        "keywords": "",
        "img_src": "assets/img/NewHampshire-Fall.jpg",
        "lastmod": "2025-04-08",
        "changefreq": "weekly",
        "source": "/src/pug/articles/architecting-agentic-services-in-net-9-semantic-kernel-enterprise-ai-architecture.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 93,
        "Section": "Development",
        "slug": "articles/ai-observability-is-no-joke.html",
        "name": "AI Observability Is No Joke",
        "content": " humorous look at AI observability through the lens of a joke-fetching agent. Learn why knowing what your AI did matters.",
        "description": "A  humorous look at AI observability through the lens of a joke-fetching agent. Learn why knowing what your AI did matters.",
        "keywords": "AI observability, agent monitoring, jokeapi, debugging AI, API call verification",
        "img_src": "assets/img/FranceCastleFlower.jpg",
        "lastmod": "2025-04-17",
        "changefreq": "weekly",
        "source": "/src/pug/articles/ai-observability-is-no-joke.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    },
    {
        "id": 94,
        "Section": "Case Studies",
        "slug": "articles/building-teachspark-ai-powered-educational-technology-for-teachers.html",
        "name": "Building TeachSpark: AI-Powered Educational Technology for Teachers ",
        "content": "How a conversation with my daughter led to creating TeachSpark - a sophisticated .NET 9 platform that uses OpenAI to generate Common Core-aligned worksheets for teachers. Includes code examples and technical architecture insights.\r\n",
        "description": "How a conversation with my daughter led to creating TeachSpark - a sophisticated .NET 9 platform that uses OpenAI to generate Common Core-aligned worksheets for teachers. Includes code examples and technical architecture insights.\r\n",
        "keywords": "",
        "img_src": "/assets/img/MurdoHighlandCoo.jpg",
        "lastmod": "2025-04-26",
        "changefreq": "weekly",
        "source": "/src/pug/articles/building-teachspark-ai-powered-educational-technology-for-teachers.pug",
        "subtitle": "",
        "author": "Mark Hazleton",
        "summary": "",
        "conclusionTitle": "",
        "conclusionSummary": "",
        "conclusionKeyHeading": "",
        "conclusionKeyText": "",
        "conclusionText": ""
    }
]
