[
    {
        "id": 1,
        "image": "assets/img/frogsfolly.png",
        "p": "Frogsfolly",
        "d": " My first website, setup to share photos with my family but is now a \u0027Kitchen Sink\u0027 of demos and test ideas. The site is built with  Web Project Mechanics CMS.",
        "h": "https://frogsfolly.com"
    },
    {
        "id": 2,
        "image": "assets/img/travelfrogsfolly.png",
        "p": "Travel Frogsfolly",
        "d": "A website with places we have traveld with a few pictures and descriptions of the highlights. The site is built with  Web Project Mechanics CMS",
        "h": "https://travel.frogsfolly.com"
    },
    {
        "id": 3,
        "image": "assets/img/jmshawminerals.jpg",
        "p": "JM Shaw Minerals",
        "d": "A website for a collector of fine gemstones.  Uses Web Project Mechanics CMS and some custom code for tracking each item in the collection.",
        "h": "https://jmshawminerals.com"
    },
    {
        "id": 4,
        "image": "assets/img/controlorigins.jpg",
        "p": "Control Origins",
        "d": "At Control Origins, our mission is to empower organizations with innovative technology solutions that drive value creation and enable them to achieve their business goals. We are committed to delivering exceptional results by leveraging cutting-edge technologies, industry expertise, and best practice frameworks. Through our comprehensive approach, we help businesses streamline their operations, align with regulatory requirements, and stay ahead in today\u0027s rapidly evolving digital landscape.",
        "h": "https://controlorigins.com"
    },
    {
        "id": 5,
        "image": "assets/img/pmcontrolorigins.png",
        "p": "Project Mechanics",
        "d": "A resource sharing insights and strategies on effective project management and IT service delivery.",
        "h": "https://markhazleton.com/projectmechanics/"
    },
    {
        "id": 6,
        "image": "assets/img/dataanalysiscontrolorigins.png",
        "p": "Data Analysis Demo",
        "d": "A demo web application of what you can do with the .Net Framework and CSV files for data analysis.",
        "h": "https://dataanalysisdemo.markhazleton.com"
    },
    {
        "id": 7,
        "image": "assets/img/employeemvccrudcontrolorigins.png",
        "p": "Net 8 Sample MVC CRUD",
        "d": "A project to try out new approaches and technologies.  This started in Active Server Pages (ASP) but has evolved to use some of the latest features of AspNet version 8. The project is on Github.",
        "h": "https://samplecrud.markhazleton.com/"
    },
    {
        "id": 8,
        "image": "assets/img/asyncwebsamplecontrolorigins.png",
        "p": "Net 7 Async Demo",
        "d": "A demonstration of Asyc methods for Api and Web pages. Includes integration with Open Weather. Source is on Github github.com/markhazleton/webspark ",
        "h": "https://webspark.markhazleton.com/asyncspark"
    },
    {
        "id": 9,
        "image": "assets/img/mechanicsofmotherhood.png",
        "p": "Mechanics Of Motherhood",
        "d": "A blog for my wife to share her recipies, thoughts and experiences as a mother.  Uses ControlSpark CMS a custom CMS I wrote in Net 8.",
        "h": "https://mechanicsofmotherhood.com/"
    },
    {
        "id": 10,
        "image": "assets/img/promptspark.png",
        "p": "PromptSpark",
        "d": "A LLM prompt management and comparison tool. Prompt Spark helps developers and businesses optimize the use of LLM models by managing, tracking, and comparing system prompts efficiently. ",
        "h": "https://webspark.markhazleton.com/promptspark"
    },
    {
        "id": 11,
        "image": "assets/img/reactspark.png",
        "p": "ReactSpark",
        "d": "A modern, responsive portfolio website built with React 19, TypeScript, and Vite. ReactSpark demonstrates contemporary web development best practices and serves as a reference implementation for building React applications. Source code available on GitHub at github.com/markhazleton/reactsparkportfolio.",
        "h": "https://reactspark.markhazleton.com"
    }
]
